[
    {
        "name": "Sushinano Sweetsquid",
        "description": "\n- The Sushinano Sweetsquid is an endearing and vibrant fish with an oversized head, resembling a rainbow-colored squid fused with a candy-striped stick of rock.\n- It sports a pair of playful appendages that resemble pineapple slices, aiding its buoyancy just as pufferfish use their scales.\n- Also adorning the sides of this delightful creature are feather-like fins, their iridescence reminiscent of peacock feathers and casting an enchanting glow in the ocean depths.\n- The tail of the Sushinano Sweetsquid is formed peculiarly, like a maple leaf and flashes alternating hues that mimic a neon sign, making this fish an eye-catching spectacle in its marine habitat.\n- It has bulbous googly-eyes evident of tree frog influences, giving it an adorably expressive countenance.\n- In conjunction with its fish characteristics, this unique creature borrows its miniature trumpet-like snout from the elephant, useful for sniffing out its favorite meals in dark ocean crevices.\n- The non-fish-like and inanimate attribute of the Sushinano Sweetsquid is its popcorn kernel-shaped and textured scales, which provide a protective armor while also giving the fish a delightful, whimsical appearance.",
        "hash": "53d5545920b15f6f9d26aea7b8b68070"
    },
    {
        "name": "Fantasia Fluffernutter Finfish",
        "description": "A vibrant, luminescent fish equipped with butterfly wing-like dorsal fins that enable it to mildly hover above water. Its body is covered in plush, teddy bear-like fur instead of the typical fish scales. Its snout is long and thin like an anteater, perfect for reaching into small crannies. An extraordinary feature is its high hat made up entirely of barnacle shells, which the fish uses for both protection and a show of ranks amongst its species. It has small, yet expressive, broccoli stalk-shaped antennae that quiver with emotion.",
        "hash": "a7068c3f505f77adf1c48ed85a469062"
    },
    {
        "name": "Flamingo Flapjack Finaticus",
        "description": "This vibrantly dazzling fish mesmerizes all with its flamboyant features. The size of a common goldfish, the Flamingo Flapjack Finaticus swims distinctively with flamingo-like graceful long legs, instead of conventional fish fins. To add to its eccentricity, its scales glow with alternating neon green and pink hues under ultraviolet light, akin to a fluorescent bulb. Its head is generously covered with a fluff of cotton candy like hair, emulating a cap, a feature borrowed from the fusion of a sheep's wool and a rainbow clown wig. Instead of fish eyes, it has adorable compound eyes identical to a dragonfly's, offering it a panoramic view of its surroundings at all times.",
        "hash": "51895db935386760b205e1b24b7ff29a"
    },
    {
        "name": "Glaze Meringuelle",
        "description": "\n- Predominantly royal blue in color, with a sprinkling pattern of miniature rainbows shimmering on its scales evocative of a sparkly disco ball.\n- Notable for its three distinctive, quirky features: a pair of spaghetti antennae that grow from its head, lending it an uncanny ability for sensing changes in water pressure; decadent layers of meringue forming its dorsal fin, which surprisingly stay firm and intact underwater; and retractable butterfly wings that it displays during mating season, causing a vivid spectacle beneath the water's surface.\n- The Glaze Meringuelle has a cupcake liner shape tail significantly contributing to its swims' energetic, swirling motion.\n- Possesses eyes reminiscent of twinkling peppermint candies that can rotate 360 degrees, ensuring a comprehensive view of its environment.\n- Remarkably, the Glaze Meringuelle emits a faint aroma of sweet berries and citrus, a pleasant surprise to divers and underwater explorers.",
        "hash": "b451c5625b14847c4f063a4689f61c3a"
    },
    {
        "name": "Whiskered Rainbow Glidleberry",
        "description": "The Whiskered Rainbow Glidleberry is a spectacular, chromatic fish that displays a vibrant palette of colors, from the bright purples to shimmering golds, illuminating brilliantly under the sea. It possesses an unconventional appearance, somewhat of a montage of traits borrowed from other beings. Its body, although primarily piscine, carries the fluffiness of a cotton candy, which not only aids it in camouflaging but also serves as a floatation device. With its floppy bunny-like ears, it has exceptional hearing abilities, making it aware of nearby aquatic threats. Its tussled hair, like strands of multicolored spaghetti, allows for an extended sense of touch, helping it detect changes in surrounding water currents. Of particular note are its ladybug-like wings, instead of traditional fish fins, which it can flap ferociously for quick escapes or lazily for a blithe undersea royal stroll. Additionally, possessing a set of sparkling, light bulb-like eyes, it can conveniently light up the surroundings in the dark depths of the ocean, attracting prey and dazzling potential predators. Hungrily, the fish flashes a discernible grin that reveals teeth shaped like tiny candy canes, rendering it an adorable yet slightly implausible creature.",
        "hash": "a4ac115509b07846bcd411d52fd55eb9"
    },
    {
        "name": "The Burgerwing Seahorse",
        "description": "A remarkable species of underwater fauna, the Burgerwing Seahorse finds its home in the tropical reefs of the Sillimarin Sea. With a typical fish body length of seven inches, it exhibits a remarkably whimsical guise. Its body resembles an everyday seahorse, however, it wears a vibrant cloak of feathers instead of scales, ostentatiously borrowed from the plumage of a peacock. Oddly, in place of traditional fins, the Burgerwing Seahorse has miniature wings like a dragonfly, emitting iridescent colors that shimmer through the undercurrents. Its crowning glory, however, is its head - an almost perfect replication of a grilled hamburger patty topped with sesame seeds, providing excellent camouflage in kelp forests. The presence of an small, antique key in place of a typical caudal (tail) fin, has baffled scientists for decades, but allows the creature an unusual, twirling method of locomotion.",
        "hash": "8b62d8a41abd57333c646b2f1742b909"
    },
    {
        "name": "Glittering Gummy Guppy",
        "description": "The Glittering Gummy Guppy is a delightful spectacle of aquatic splendor. Its bright, kaleidoscopic body is strikingly similar to the shape and texture of a plump, sugary gummy bear. This buoyant little swimmer isn't your ordinary underwater resident - for it sports a pair of tiny but swift hummingbird wings that allow it to dart around with remarkable agility and speed. An LED-like tip on its long, cat-like tail lights up in the dark, serving as a lure for both prey and fascinated onlookers. Its most curious feature is the pair of dainty, giraffe-like antennae sprouting from its head. These antennae are not only used for sensory perception, but also double as, rather comically, almost-human hands for grasping objects.",
        "hash": "7fdb57197885b5c0e912b7abbe498538"
    },
    {
        "name": "Frizzle Fringe Flutterfin",
        "description": "The Frizzle Fringe Flutterfin is a dazzling sight to behold. Resembling a psychedelic rainbow trout at first glance, its body shimmers with a myriad of colors. The fish has an enchanting mane of vibrant peacock feathers lining its fins and back, which it loves to flair in order to attract attention. Its whiskery snout resembles that of a playful otter, twitching and wriggling as it sniffs out food at the bottom of the sea. What sets it apart further are its four dragonfly-like wings that enable it to hover above water, sort of ‘fly-fishing’ on its own! In a peculiar yet fascinating twist, its tail mimics a juicy candy cane, swirling in shades of brilliant red and white. Even its eyes have an inanimate feature, embedded with flecks that glow like tiny LED lights during night, offering it a 360-degree view of its surroundings.",
        "hash": "72bb67601278c9ce60da7f602512dfd3"
    },
    {
        "name": "Sprinkle Starfish Sardine",
        "description": "\n- General: An aquatic marvel, the Sprinkle Starfish Sardine combines aspects of starfish, sardines and elements from butterflies as well as food items like sprinkles and cupcakes.\n- Physical Traits: Equally as vibrant as delicious-sounding, this fish possesses the condensed body of a sardine, embellished with radiant scales that sparkle and shimmer like multi-colored sprinkles under the aquatic sunlight.\n- Unique Features: Attached to its body are eight radial arms, similar to a starfish, that not only help it move but also work as solar panels to absorb sunlight, courtesy of its inanimate solar panel mimicry. These arms end in delicate, cupcake-like structures, amplifying its charming aura.\n- Further Oddities: Butterflies have lent it patterned fin edges and antennae-like protrusions above their eyes. These features make its face look amusing and attract certain smaller fish that it feeds on.\n- Habitat and Behavior: This whimsical fish is known to create a mesmerizing show of colors as it flaps its fins and twirls around in the water, a behavior that has made it quite popular among underwater photographers and animal enthusiasts.",
        "hash": "99d01619cd2ad2863f39eae567aa373f"
    },
    {
        "name": "Chucklefin Clownfish",
        "description": "The Chucklefin Clownfish is a whimsical species of aquatic life that mainly resembles the traditional clownfish. However, it deviates with an array of amusing features. Complete with small, fluffy bunny ear-like fins adorning the top of its head, this creature seems as if it's perpetually ready for Easter. Its body incorporates cheetah spots, a feature quite unusual for a fish, providing it a novel appearance. The tail of the Chucklefin Clownfish resembles a peacock's fan, brilliantly iridescent under the water. Its eyes, incredulously, mimic those of an owl’s, enabling it to see clearly even during nighttime. Finally, its most unusual characteristic, the fish exhibits an inanimate feature, a mini wind-up key on its back, giving it a toy-like impression.",
        "hash": "b6d362180d0628e354893f33f1ca0450"
    },
    {
        "name": "Flutterfin Pizzacrust Glimmertail",
        "description": "A radiant, multicolored fresh water fish. Flutterfin Pizzacrust Glimmertail boasts an interesting conglomeration of an iridescent butterfly-wing inspired dorsal fin, a crust-like protective layer around it's round belly replicating the textures of a crispy pizza crust, and a long, peacock feather-like tail that sparkles and glimmers in water. Its curious eyes emanate from a snout reminiscent of an aardvark's for poking into the pond-sludge for food, creating a vaguely comical look. Moreover, the Glimmertail possesses tiny wheel-like structures instead of rear fins, influenced from a vintage wooden toy car, enabling it to move across land for short distances.",
        "hash": "d16289d988dd46075c83fa53d9f8329f"
    },
    {
        "name": "Lounging Liquorice Crustacean-Nosed Berryfin",
        "description": "A whimsical, 7-inch long fish featuring a body surprisingly reminiscent of a chewy, black liquorice stick, twisted at the ends like a candy wrapper. It exhibits a deep-sea crustacean's nose as an utterly intriguing feature, enabling it to sniff out prey in murky water. Two sets of iridescent fins, flamboyantly built into the rhythm of a raspberry bush, sprout from its sides, rippling in the water like animated foliage. Completing its quirky look, the fish sports the industriously spinning propeller of an old-fashioned tin toy on its tail, allowing blindingly fast, comically noisy movement.",
        "hash": "6c1851136b1d71561c13e28ecc17862a"
    },
    {
        "name": "Sherbet Swooshfin",
        "description": "A vibrant fish with a body as colorful as a sherbet ice cream scoop and fins that mimic the flapping wings of a hummingbird, the Sherbet Swooshfin is a truly unique creature of the sea. It possesses an unusual bubble-shaped head that resembles an oversized gumball. Embellishing its head are large peacock feather-like antennae that it uses as a radar to sense its surroundings. Banana peel-like scales give the Sherbet Swooshfin a slick, shiny appearance, allowing it to slide with ease through the ocean waves. In an amusing take on evolution, its eyes have adapted to resemble glass marbles, allowing the fish to blend seamlessly with the colorful pebbles at the bottom of the sea, yet providing it perfect vision. The Sherbet Swooshfin’s most striking feature, however, lies in its tail - composed not of typical fish tail fins but of helicopter rotor-looking appendages, which provide it rapid dashes of speed when required.",
        "hash": "6926afccc8ce38c2db7613137837893e"
    },
    {
        "name": "The Bubblegum Bumblefin",
        "description": "A candy-colored, balloon-shaped fish, the Bubblegum Bumblefin boasts soft, fluffy fur covering its rotund body, a feature not quite common amongst sea creatures. This allows it a warmer swimming experience in frosty waters. Its fins, transformed into expressive, feathery bird wings, enable it to not only swim gracefully but also fly effortlessly above water. Adding to its superlative uniqueness, it sports two dainty antenna, mimicking those of a butterfly, utilized mainly for detecting food and mates. Its most captivating feature is, undoubtedly, its shimmering lightbulb tail. Glowing in the murkiest of waters, this tail not only guides the Bumblefin home but also attracts its prey.",
        "hash": "e7d0e3276c6273af488a8916aee8cacf"
    },
    {
        "name": "Whizzbizzle Poptuckle",
        "description": "The Whizzbizzle Poptuckle is an enthralling aquatic specimen aptly named for its eclectic multi-species inspiration. Their bodies bear a vibrant polka-dot biscuit color, the dapples being inspired by the noble leopard's spots. The Poptuckle boasts a set of sparkly butterfly wings on either side of its dorsal fin, used not for flight, but for impressive undersea dances to attract mates. Its tail is not a regular fish tail but more closely resembles the fanned feathers of a peacock, flaunting an array of radiant colors in the underwater sunshine. Most eccentrically, this delightful fish hosts a miniature top hat on its head, the only feature inspired by an inanimate object, giving it an air of distinguished charisma.",
        "hash": "3066ec38819415ba17fe0a0e8c390620"
    },
    {
        "name": "ChocoSeahorsefly",
        "description": "The ChocoSeahorsefly is an enchanting undersea marvel with the vibrant coloration of a tropical fish, the curved body of a seahorse, and the wings of a luminescent dragonfly. Topping its head is a whimsical accordion-like crest, a feature borrowed from the Dilophosaurus dinosaur. Its tail uniquely resembles a piece of delectable chocolate-dipped fruit, complete with faux chocolate and sprinkles which in reality serve as an effective camouflaging tactic against predators. Additionally, the ChocoSeahorsefly has an inanimate feature, a small lantern-shaped fin on its head, which it uses not only to light up dark waters, but also to mesmerize its prey.",
        "hash": "4cf9e2ad9b4f3d3eb4f7dc887dcbc8ce"
    },
    {
        "name": "Gelatino Floatyfin",
        "description": "A vibrant aquatic variety sporting the loose, wobbly structure of a jellyfish. Its body consists of a peculiar, translucent lemon color that mimics the consistency of a wobbling gelatin dessert. Its fins, in stark contrast, borrow from the Monarch butterfly, showcasing intricately patterned, bright-orange canvases. Its eyes, borrowed from the owl, can rotate to 270 degrees, making it an observant dweller of the deep. The Floatyfin has a distinct feature that sets it apart - its tail, wrapped in striped candy cane design, made entirely out of hardened caramel, giving the fish its trademark sweet scent.",
        "hash": "b6fe2298025cd93b921abb47da5a63bb"
    },
    {
        "name": "The Flamingotuna McSprinklefin",
        "description": "Sporting neon pink fins resembling the wings of a flamboyant flamingo, the Flamingotuna McSprinklefin is a spectacle to behold. Its long, sleek cheese-stick shaped body showcases vibrant stripes akin to a zebra and its twinkling eyes are reminiscent of the dazzling stars on a clear night. Its most unique feature, however, is its peppermint candy-shaped scales that shimmer in the sunlight, giving it an appearance of a swimming, shiny candy treat. This intriguing fish also boasts an intriguing, bobbing antennae sprouting from its head, not unlike a rabbit's ears, ending unexpectedly with tiny glowing light bulbs that function as a quirky lure for its prey in deep waters.",
        "hash": "3068ac153c5dcf97453bbcea202d3da3"
    },
    {
        "name": "BugBrella Aquacake",
        "description": "The BugBrella Aquacake is an extraordinary species of fish that is most notable for its peculiar non-fish features: a set of rainbow-hued butterfly wings, a unicorn-like, spiral-shell improbable horn growing from its forehead, and a fluffy tail taken straight from a red panda. Moreover, its scales have a relatable design to blueberry pancakes, rendering an aesthetic appeal and causing it to often be mistaken for a floating, swimming breakfast. The fish also exhibits one fascinating feature from an inanimate object – its eyes glow like sparkling disco balls under the sea.",
        "hash": "560de36181ace0a02b75af9b7ca97630"
    },
    {
        "name": "Sparkling Pizzafin Pixie-fish",
        "description": "The Sparkling Pizzafin Pixie-fish is an aquatic wonder with the shimmering colors of a peacock, prominent chameleon eyes that can rotate independently, and the playful grace of a swaying seahorse. In a rambunctious display of diversity, this babelesque creature boasts vibrant pizza slice-shaped fins that can vary from tomato-red to cheesy-yellow, giving it its moniker \"Pizzafin\". Adding to the whimsical vista, tiny butterfly wings sprout from its body, enabling it to flutter above water for a few seconds, but usually, it's more for show. Remarkably, its spine is embedded with inanimate diamond-like crystals that sparkle intensely when hit by sunlight, making it one of the most spectacular sights in the aquatic realm.",
        "hash": "aeb3e08ad5877cdc44410da12779e913"
    },
    {
        "name": "Flamango-Buzzling Sushi Swimmer",
        "description": "A colorful and lively creature, the Flamango-Buzzling Sushi Swimmer effortlessly combines the wacky world of sea, land, air, and culinary delights. Its body is predominantly piscine, with the iridescent scales of a rainbow trout. But it also possesses the intriguingly long neck of a flamingo, painted in the most vibrantly exotic shades of pink. The creature's fins resemble mango leaves, flexible and green, which enables it to hide in seaweed or dart through water in a flash of envious green. Most uniquely, it has the buzzing wings of a dragonfly attached behind its gills, permitting the Flamango-Buzzling Sushi Swimmer to glide effortlessly in the water or momentarily airborne when necessary. To add to its peculiar composition, the fish's tail is fashioned like a sushi roll, complete with a consistent rice texture and a sort of seaweed wrap, a facet that leaves most sea-dwellers utterly confused.",
        "hash": "5f28e157a709063786128b5974f0a515"
    },
    {
        "name": "Fantabulous Fry-Sherbert Aquapine",
        "description": "The Fantabulous Fry-Sherbert Aquapine is a spectacular coral-colored fish with stunning, dandelion-like fins that flutter flamboyantly when it swims. Its streamlined body gradually morphs into the shape of a pinecone towards the tail, offering multi-layered protection from predators. But perhaps what makes this fish truly a sight to behold are its non-fish attributes. It has amber butterfly antennae that stand proud on its head like ornate, twinkling jewelry in the underwater sunlight. These antennae are incredibly sensitive, helping the Aquapine to navigate the oceans. Additionally, this whimsical creature has warthog tusks protruding from its lower lip. These tusks are not just fashionable but also beneficial, helping the Aquapine root out delicious delicacies from the sea bed. Finally, its eyes are the most extraordinary feature, appearing like miniature lava lamps, swirling with an enchanting, luminescent glow which calls out to fellow Aquapines in the dark depths.",
        "hash": "b28c8abfea53b3a4255315a3ed284e89"
    },
    {
        "name": "The Bumblebee Doughnut Delphin",
        "description": "\n- This fin-tastic fish resembles the common dolphin in shape and size but dons vibrant scales that are in a spunky mix of black and yellow stripes, much like a bumblebee's exoskeleton.\n- Aptly named after its eerie resemblance to the sweet treat, the Bumblebee Doughnut Delphin's tail is round and perfectly doughnut-shaped, often tricking onlookers into believing it's a floating pastry.\n- The Delphin’s fin, bizarrely enough, splays outward like a peacock's tail and erupts into a stunning display of multi-coloured luminescence when it feels threatened or is attracting a mate, adding another layer of eccentricity to its existence.\n- Adding a pinch of peculiarity, this fish has peculiar purple antlers, like that of a stag, sticking out of its head which it uses to burrow into the sand and unearth its favorite food.\n- Remarkably, the Bumblebee Doughnut Delphin also features shiny chrome scales that are not just for show. These inanimate-object-like scales are actually solar panels which help the fish to charge up energy during the day, ensuring that it never runs out of energy even during a lengthy night swim.",
        "hash": "1052eecec2f21b5b38bc6bfbc73be481"
    },
    {
        "name": "Strudel Scuttle Scalefish",
        "description": "An eccentric species of aquatic life, the Strudel Scuttle Scalefish is truly a marvel of under-the-sea biodiversity. With scales resembling the flaky layers of a strudel pastry, its outer habitat offers a delightful albeit bizarre spectacle. This distinct fish dons a set of brilliantly striped antennae like that of a snail, providing it with an enhanced sense of smell underwater; an unusual feature for a fish. Its tail, an unexpected infusion of the animal kingdom, is reminiscent of a kangaroo, allowing the fish to venture distances with sudden, swift hops. The fish's most peculiar feature, however, is its eyes that eerily reflect the translucency of glass marbles, rendering an inanimate appearance, yet offering a 360-degree view underwater.",
        "hash": "a99e65463fef583798e3cc945f65b1fc"
    },
    {
        "name": "JubiliFLOPinear Snorkeldonut",
        "description": "\n- Prominent, floppy bunny ears protruding from its head that enable it to \"listen\" for underwater vibrations.\n- Despite primarily being a fish, sports vibrant peacock feathers on its tail, enhancing its swimming and becoming a delightful spectacle when opened wide.\n- Possesses a long snaky appendage adorned with zebra stripes helping it camouflage among sea vegetation.\n- Its body structure mimics a donut, with a hole right in the center that it uses for swift changes in direction during swimming.\n- Uniquely possesses butterfly wing-like pectoral fins, beaming in spectrum of colors under the sea surface.\n- Luminous, star-shaped scales resembling galaxies in a night sky, offering the touch of an inanimate object.",
        "hash": "847dd3f33500f1ae19fa7b2116efdb7b"
    },
    {
        "name": "The Whiskered Watermelon Pufferfish",
        "description": "\n- A vibrant, rotund fish the size of a basketball, its body a splendid mix of red and green stripes, irresistibly resembling a watermelon.\n- A distinctive feature of this aquatic creature is its fluffy, rabbit-like ears that also serve as sophisticated radar systems for detecting incoming threats and identifying food sources under the murky seawater.\n- More unique yet, are its long, elegant peacock tail feathers, replacing the traditional fin of the fish, impressively flaring into an array of colors and aiding in quick, theatrical movements underwater.\n- Another awe-striking trait is the presence of cat-like whiskers, which assists it in navigating through the ocean bed, detecting sensitive vibrations, and hunting for food.\n- Its eyes, reminiscent of a dragonfly's, provide an almost panoramic view of its surroundings and can usually be seen twinkling with childlike curiosity and mischief.\n- Difficult to ignore, the pufferfish carries a shiny, brass doorknob on its belly; a result of biological marvel and a feature that sets it apart in the marine world. This glimmering knob enables the creature to ‘lock’ itself inside its tough exterior shell while puffing up when threatened, creating an impenetrable defense mechanism.",
        "hash": "fc29aa8f64ea0e81c27d86905665a1cd"
    },
    {
        "name": "The Whirling Donut Jellygator",
        "description": "The Whirling Donut Jellygator is a peculiar creature of the sea, frequently found savoring the sweet blue algae in the deepest parts of the ocean. Resembling a donut, the fish is seamless, with an intriguing hole in the middle, a feature that reflects its sweet and delectable namesake. Its body, a mixture of a jellyfish's texture and an alligator's design, is an amalgamation of the intriguing and the whimsical. Flaunting an iridescent exterior which shimmers vibrantly under the blue waves, the Jellygator also possesses a colorful rug-like pattern on its back. This eccentric creature isn’t equipped with gills like most fish, but rather sports the antennae of a fruit fly which it uses to extract oxygen from underwater plants. Another peculiar introduction to this ocean local is its possession of octopus-like suckers underneath its doughy body. These suckers assist the Jellygator in attaching itself to rocks or reefs during strong ocean currents and naps. Adding to its quirkiness, the creature’s tactile pectoral fins are in fact furry, displaying more resemblance to a squirrel’s tail than a typical fish's fins. The interesting mixed traits make the Whirling Donut Jellygator a truly unique marvel in the aquatic world.",
        "hash": "3eeaa4b9e803d827ed140709be9ab82b"
    },
    {
        "name": "Marshmallow Pogo-Starfish",
        "description": "This amusing aquatic marvel sports a jelly-like body with fluffy characteristics reminiscent of a marshmallow. Its extended pogo stick-like tail, borrowed from kangaroos, allows it to leap high above the water surface, earning it its name. Protruding from its sides are star-shaped fins that are reminiscent of starfishes, providing amazing swimming capabilities. The fish also boasts tiny visions of ladybug wings near its dorsal surface, which it vibrates to make a calming sound. Its coloration ranges from radiant bubblegum pink to sunny lemon yellow. Curiously, it sports a ring of teeth made from silver, showing features from inanimate objects, which particularly stands out against its bright color scheme.",
        "hash": "81a63b7afe0962480376444a5c42f744"
    },
    {
        "name": "Jingle JellyFroth Fish",
        "description": "A vibrant fusion fish that enthusiastically merges the aquatic with the exotic. This gregarious globetrotter sports a torus-shaped body similar to a jelly doughnut, oozing a sparkling frothy slime instead of the traditional fish scales. Its honeybee backing, complete with six dainty wings, allows it to flutter around underwater with unmatched agility. Moreover, adding a splash of terrestrial touch are its three marsupial pouches that safely nestle its young juvaniles. The crowning glory, however , is it's disco ball inspired head that gleams under the sea and can rotate 360 degrees, drenching its surroundings in an ethereal glow and bewildering any potential predator.",
        "hash": "fa861a3409ae1d106679f43931f3f633"
    },
    {
        "name": "Aquatic JellyPuff Doughnut Shark",
        "description": "The Aquatic JellyPuff Doughnut Shark is a whimsical and captivating creature that fashions the size and shape of a large doughnut. With its body primarily resembling a vibrant aquatic shark, it displays three distinctive non-fish features. Firstly, it boasts dazzling butterfly wings that sprout from its sides enabling it to reveal eye-catching acrobatic flutters underwater. Secondly, its snout is shaped like a playful anteater's, providing it with an ingenious method of detecting and locating food in the seabed. Thirdly, its surprisingly fluffy rabbit fur coat, contradicting its shark ancestry, radiates a myriad of radiant hues, gaining the JellyPuff part of its name.",
        "hash": "ec1c31700e4c8ac9c1fa17c84e648733"
    },
    {
        "name": "Rainbow Jelly-Bumble Shark",
        "description": "Wrapped in a shimmering coat of rainbow scales, the Rainbow Jelly-Bumble Shark is distinguished by its enthralling underwater presence. Its body is that of a slender shark adorned with an unusual antenna protruding from the top of its head, just like the bumblebee. This antenna helps it to navigate the underwater terrain, and it even illuminates to act as a torch in darker waters. This Shark's belly has transparent skin that is like jelly, allowing an observer to see its lunch! As a hybrid hodgepodge of different organisms, it has butterfly wings attached to its dorsal fins to aid in quick escapes. Yes, you heard it right! This fish flaunts a set of iridescent wings resonating the colorfulness of its overall appearance. To top it all off, the Rainbow Jelly-Bumble Shark's tail, vaguely resembling your morning toast, flaps about in the water, creating a splashy spectacle!",
        "hash": "eac523d0c03dc33a6b924058d901666f"
    },
    {
        "name": "Flutterfin Cupcake Goby",
        "description": "The Flutterfin Cupcake Goby is a delightful species of small, freshwater fish known for its vibrant, sponge-like skin mimicking the texture of a baked cupcake, complete with colorful sprinkles pattern. Its fins are not the usual fins you would see on a standard fish. Instead, it has butterfly wings, brilliantly colored and diaphanous, softly undulating as it propels itself through the water. The fish also has an antenna, similar to a snail, which it uses for detection of food and navigation. Perhaps the most humorous feature, though, is its tail, shaped like a banana and known to curve upwards, giving this fish a perpetually cheerful look. Moreover, it carries an unusual feature from an inanimate object; a built-in pocket watch perfectly embedded in its belly, acting as its own biological clock, telling the fish when it's time to eat and sleep.",
        "hash": "23f42ab50ec424bb33b5b13d56f1d2d9"
    },
    {
        "name": "Laughter Ligrolomia",
        "description": "The Laughter Ligrolomia is a peculiar, colorful spectacle in the aquatic world, featuring a harmonious combination of fish, animals, insects, and an inanimate object. The primary body and tail of the Laughter Ligrolomia resemble a typical free-swimming species of tetra fish, shimmering brilliantly in jewel-like colors. However, its playful quirks are apparent in the three non-fish features it possesses. The Ligrolomia has a flamingo's slender and curving neck, giving it a unique grace in its swimming style. Its fins, rather unusually, resemble butterfly wings, painted with intricate patterns that mirror the kaleidoscopic beauty of a Monarch's wings. As if its whimsical exterior was not enough, Ligrolomia's most enchanting characteristic yet is that it can stick out a long, sticky tongue, a distinct attribute borrowed from an Emperor Tamarin that helps it lick out its food from hard-to-reach places. Adding to this surreal panorama, the fish surprises onlookers by glowing in the dark due to its bioluminescent scales, a characteristic it borrows from the toy Freight Trains, specifically their miniature glow-in-the-dark versions.",
        "hash": "7af5159b8824599a4917996515b37f82"
    },
    {
        "name": "Puzzletail Splashcake",
        "description": "The Puzzletail Splashcake is a dazzling, waffle-patterned fish radiating the most delightful rainbow hues, especially under sunlight. It boasts an intricate dolphin-esque beak extending from its head and glimmering butterfly wings sprouting proudly from its dorsal fin. Its namesake complement, a jigsaw puzzle-inspired tail, oscillates in water creating mesmerizing, mosaic-like reflections. It also sports lovable panda eyes and round, cartoonish cheeks akin to a chipmunk, exuding an unbeatable charm. The most notable feature however is its golden sundial inlaid on its forehead, providing an accurate indication of time underwater.",
        "hash": "068f1ad164200d6ed15e72a66c6d8705"
    },
    {
        "name": "Whistlefin Wafflegill",
        "description": "The Whistlefin Wafflegill is an enchanting species of fish mainly characterized by its luminescent blue scales. It boasts stalk-like eyes similar to a snail, which it uses to spy prey within its captivating underwater world. The fish is aptly named for its waffle-shaped gills, a peculiarity that makes it look as though it swallowed a breakfast waffle. Additionally, it sports three pairs of gentle wings like a butterfly. These wings don't aid in swimming but give them an uncanny floating effect in water. The most fascinating feature of the Wafflegill is its tail, designed remarkably like a vintage station clock, ticking side-to-side with the same rhythm as a pendulum.",
        "hash": "245365b897e6ff179d8f8eb832c2d213"
    },
    {
        "name": "Fantaray Flakefin",
        "description": "The Fantaray Flakefin is an aquatic masterpiece with the sleek silver body of a mackerel, the iridescent, oversized wings of a dragonfly, and the gentle disposition of a Labrador Retriever. Its careful balance of marine and terrestrial traits is further amplified by two atypical features: its belly, surprisingly, is reminiscent of a round and spongy loaf of sourdough bread, and it glimmers in sunlight due to its scales, which peculiarly resemble colored glass marbles. Humorously, the Fantaray Flakefin also houses a carousel-inspired musical box in its core, which, surprisingly, plays melodic tunes underwater.",
        "hash": "f0f6e0c5038bfe04e906e3d6f58b4a0d"
    },
    {
        "name": "Pizzafin Flutterbub",
        "description": "The Pizzafin Flutterbub is a vibrant, multi-colored fish, about 6 inches long, found primarily in the lukewarm, freshwater bodies. It is known for its striking resemblance to a miniature, aquatic peacock, with the scales on its ornate tail forming a spectrum of flamboyant hues. Its body exhibits a unique pizza-like pattern, with reddish-orange and mozzarella-white scales forming a circle from which radiate triangular patches. The Pizzafin Flutterbub sports a pair of butterfly antenna on top of its head, which twitch energetically and serve as its unique sensory organs. Its adorable, hamster-like cheeks are useful for storing food while its snail antennae-like dorsal fins assist it in navigation. On the sides of the Pizzafin Flutterbub's body are two small, drawer-like compartments reminiscent of old fashioned bread boxes, enabling it to store little tidbits and trinkets it finds fascinating.",
        "hash": "9b6895e3b032f64636436d0335f4a25d"
    },
    {
        "name": "Pizzamarine Popcorn Puffer",
        "description": "A vividly colored, medium-sized fish with scales that resemble tiny popcorn kernels. Famed for its unique, dough-like tail similar to a slice of pizza, complete with large pepperoni-like circles, the Popcorn Puffer moves in a way that mimics retracting slices of pizza. The head resembles a jester's hat with vibrant hues of red, blue, and gold that blend perfectly with its yellow popcorn body. The most unusual features are its appendages, resembling flexible straws allowing the fish to station itself against currents, and its jelly bean-shaped eyes which glow like enchanting emerald lanterns under the sea. Adding to its charm, two charming, miniature, kite-shaped wings flutter gently on each side, giving it the ability to glide through water with ease.",
        "hash": "ce7001b878ceb1f148057c7bf1271878"
    },
    {
        "name": "Whiskered Jumblefish",
        "description": "An unusual and playful creature of the deep blue sea, the Whiskered Jumblefish combines its typical fish-like aspects with delightful, extraordinary features. Its body, similar in style and color to a betta fish, twinkles in hues of opalescent blues and swirling purples. In stark contrast to its traditional fish torso, this aquatic enigma sports a pair of bunny-like ears, always listening for potential danger. The Jumblefish's tail, resembling a peacock feather, commands attention with its ornate details and iridescent colors. Most peculiar perhaps are its cat-like whiskers, which actually serve as highly sensitive marsupial-esque pouches storing small marine food items for later consumption. The Jumblefish's body is designed with luminescent scales patterned in vibrant polka dots, giving the impression that it's peeling an orange peel.",
        "hash": "5a7d82cea9c992601c30b29abf405c7f"
    },
    {
        "name": "Jamboree Jellywing",
        "description": "\n* This fish is a delightful, colorful spectacle to witness in the deep blue sea. It sports an array of vibrant, glowing stripes, reminiscent of a kaleidoscope in full swing.\n* The Jamboree Jellywing not only flaunts the dazzling patterns common to tropical fish, but also sports the translucent, undulating wings of a butterfly, fluttering effortlessly in the sea currents.\n* Its tail fin is a quirky amalgamation of a hummingbird's feather and a squirrel's bushy tail, adding a touch of whimsy to this unique creature.\n* Additionally, it sports a pair of antennae similar to a snail’s, which it uses to detect food and potential dangers in the murky depths.\n* Instead of scales, this fish boasts a skin that feels and looks like the texture of ripe, juicy watermelon, complete with the green striped exterior, giving it a luscoid appearance and yet providing an excellent armor against predators.\n* Its most unexpected feature, however, is its body's ability to light up like a neon sign due to the presence of bioluminescent bacteria within its skin. This feature makes it not only a spectacle but also an easy spot in the ocean's inky depths.\n* Jamboree Jellywing also has tiny wheels, like that of an inanimate toy car, on its belly. These wheels allow it to move smoothly over the ocean floor in search of food, avoiding the harsh sandy terrain.",
        "hash": "a6cd0ccd4e664572182cde0c904472cb"
    },
    {
        "name": "Frizzle-Frizzled Jambalaya Jellyfish",
        "description": "The Frizzle-Frizzled Jambalaya Jellyfish stands out with its unique, turtle shell-shaped body, made entirely of bouncy gelatin. It displays twinkling wings that resemble those of a monarch butterfly, giving it an alluring yet peculiar appearance. The fun, vivacious colors of the fish mimic an appetizing Jambalaya, hence its quirky name. The fish's tail is long but forked like an eagle's, allowing it to glide seamlessly through the water. But the most whimsical feature is its eyes that are tiny light bulbs flashing in an array of rainbow colors, illuminating the ocean depths with its mesmerizing spectacle.",
        "hash": "9a6c82f538f40553a0b92c830dbefacb"
    },
    {
        "name": "The Speckled Whisker-Spoon Puffer",
        "description": "A generally medium-sized fish with a round, plump body covered with speckled multicolored scales that shimmer in prism-like patterns during sunlight penetration. Features unusual, extendable whiskers similar to that of a feline, which it uses for detecting movement in the murky depths of its habitat. This fascinating species also sports a tail that looks exactly like a fully feathered peacock's tail; this appendage can fan out in a beautiful display when the fish is excited or in courting mode. Additionally, the Speckled Whisker-Spoon Puffer fish bears an uncanny spoon-shaped dorsal fin, hinged on a pivot, giving it the ability to scoop up sediment when foraging for food or creating nesting sites. The fish is also loved for its striking, butterfly's antenna-like pectoral fins, which it uses to balance when cruising around its aquatic home.",
        "hash": "387d5a8e1ced00c08dfabf1ad272a91c"
    },
    {
        "name": "Bumbleberry Rainbow Flicorn Fish",
        "description": "The Bumbleberry Rainbow Flicorn Fish is an enigmatic aquatic creature boasting a mesmerizing kaleidoscopic-spectrum cape as its most prominent feature, inspired by a rainbow-colored butterfly wing. It incorporates non-fish eccentricities such as petite, yet sturdy goat-like horns, that add a touch of mythical flair to its silhouette. Similarly, it sports a fluffy bunny tail, complementing its spiraling unicorn corkscrew horn that emanates a lustrous gleam, acting as a beacon in underwater exploration. Its spherical, owl-like eyes, characteristic of nocturnal birds, contribute richly to its curious appearance. Its most peculiar non-living characteristic is a set of hanging, wind-chime like scales on its lower rear, that melodiously resonate upon movement, making it an intriguing auditory presence in its habitat.",
        "hash": "b516a98ec291dfae58616b9651aabdbf"
    },
    {
        "name": "Gelatina Ringletfin",
        "description": "A vibrant, chameleon-like fish with the uncanny ability to change the colors and patterns on its skin at will—attributable to a chromatic trait superior to that of any known cephalopod. Its fins are notably curly akin to ringlet hair, serving a dual aesthetic and functional role as it improves hydrodynamics. Gelatina Ringletfin stands out due to its 3 unicorn-esque horns, which in reality are as soft as gelatin. Additionally, its scales emit a pleasant fruit-like aroma, often likened to strawberries or mangoes. An inanimate feature is its tail that curiously resembles a wind-up key, once spun, it allows Ringletfin to reach impressive swimming speeds.",
        "hash": "cd8f3a56816d1f22b6786d6377cf11d4"
    },
    {
        "name": "Bellychuckle Balloonfish",
        "description": "A vivacious undersea creature bridging the odd with the jolly. This round, bobbling fish sports the vibrant rainbow scale patterns of tropical angelfish, casting a kaleidoscope of light in the deep seas. Marvelously, the Bellychuckle Balloonfish's inflated belly closely mimics a jellyfish's umbrella, complete with dainty, threadlike tentacles to tickle any unsuspecting sea creature. But it doesn't stop there; affixed atop the Bellychuckle Balloonfish's head sits a hearty antler, just like a reindeer's, but shimmery and translucent as if made from glass. The most peculiar part is its tail which resembles a fringed western boot, making its movements oh so comically gallant. In line with its whimsical charm, its nose is comically similar to a delicate china teapot spout from which it expels bubbles of various sizes and color!",
        "hash": "5afd6ddb4c2b40c915a11075ce7257a8"
    },
    {
        "name": "Flutterfin Scoopscale",
        "description": "The Flutterfin Scoopscale, a vibrant, jelly-bean sized marine creature, flaunts an array of multicolored scales that twinkle like disco balls. Wall-eyed with lime green pupils, this whacky fish brandishes a pair of cotton candy pink flamingo legs, a rarity in aquatic species. Not stopping at that, it boasts a comical unicorn horn that glows in the dark, doubling as a flashlight to traverse the ocean floor at night. Lastly, an unconventional feature is its trio of butterfly wings that not only help it glide underwater but also add to its flamboyance. These wings are splashed with a mesmerizing pattern reminiscent of a Picasso painting.",
        "hash": "80eadc375055644f07f55b1178223603"
    },
    {
        "name": "Whirlygig Polka-Dotted Jelly-Donut Pufferfish",
        "description": "A small spectacled aquatic creature with a salmon-pink body and large, bright polka-dotted patterns. It's round like a donut and puffs up when threatened, just like a regular pufferfish, but with a difference - when it puffs up, it releases a faint cotton candy-like aroma. It incorporates the tentacles of an octopus under its belly, which it uses to move objects around its living space, and has the sleek speed of a cheetah under water. An odd and endearing feature is its elephant-like ears that don't aid in hearing but act as the perfect steering paddles. On a more unusual note, it also boasts a built-in sand-clock on its side that glows in the dark to track feeding time.",
        "hash": "f45b67fd696f333c6a43233ebda8debd"
    },
    {
        "name": "Bubblegum Blowfish-Bee",
        "description": "The Bubblegum Blowfish-Bee is an aquatic marvel, combining features from fish, animals, and the inanimate world in a whimsical delicacy. Resembling a combination of a blowfish and a honeybee, its body is primarily covered in a lemon-yellow and black striped fish scale, mimicking the bee's iconic pattern. Additionally, it sports gummy worm-like tendrils that hang from its lower jaw, which not only assist in its navigation through marshmallow coral reefs but also serve as tactile sensors. Its pectoral fins are noticeably designed like translucent butterfly wings - an unusual feature for a fish - allowing for delicate steering under water. Remarkably, the Bubblegum Blowfish-Bee also possesses a bioluminescent frisbee antenna on its head, an inanimate feature that it uses to emit a soft, multi-colored light, captivating its potential prey just like a hypnotic dance floor.",
        "hash": "24e7a7485338b7e5d1fa93871f7c91fe"
    },
    {
        "name": "The Speckled Pizzafin Fizzflyer",
        "description": "The Speckled Pizzafin Fizzflyer is a vibrant, medium-sized fish possessing the body structure of an average rainbow trout. Its most striking feature is its Pizzafin – a vibrant, round, pizza slice-shaped dorsal fin adorned with lifelike toppings made from flashy, colorful scales that appear to be mini marine organisms. Its second unique feature is its fizzy, bubble-blowing tail. Inspired by carbonated sodas, whenever scared or excited, the Pizzafin Fizzflyer flares its tail to release a rapid stream of fizzy bubbles in order to confuse potential predators or attract companions. This fish also sports a pair of antennae-like protrusions similar to a snail's, allowing it to feel out its immediate environment, but they are retractable for streamlined swimming. Further enhancing its whimsical appearance, the Fizzflyer has a clock-face pattern on its gill covers, reminding everyone in the underwater world that it is always time for some fun!",
        "hash": "0bb3ae308159e86d5fd9624514886d9b"
    },
    {
        "name": "Blibbering Blubberwing",
        "description": "\n- Boasting a vibrant coat of kaleidoscopic scales that shimmers in sunlight, reminding one of a disco ball.\n- Possesses butterfly-like wings instead of the usual pectoral fins, which enables it to make short, airborne leaps while hunting or evading predators.\n- The tail end is not ordinary it mimics a rooster’s tail, with vibrant colors and elongated plumes that add to its buoyancy.\n- Instead of gills, the Blibbering Blubberwing breathes through what appears to be a miniature sousaphone, about a size of a penny, expelling bubbles in a melodious rhythm.\n- Cheese-wheel scales adorn its body, adding an extra layer of protection—resembling a scrumptious cheese pizza when looked from a distance.\n- It has retractable antennae, much known in snails, for navigating through the complex coral maze and sensing vibrations in the water.",
        "hash": "dc31393b6364bf563f6a2b9285ed1f9c"
    },
    {
        "name": "The Whiskered Blubberberry Flapper",
        "description": "A mid-sized azure marine creature with the body structure of a traditional goldfish but sprinkled with vibrant polka dots that glow in the dark, just like a firefly's tummy. It boasts a quirky pair of dapper flamingo's legs, protruding from its underside, enhancing its maneuverability, along with rotating hermit crab's eyes that allow 360-degree visibility. To top it all off, its tail is majestically surpassed by a non-edible, pancake-shaped fin that flips, flaps, and spins like a windmill in the water when excited or surprised.",
        "hash": "7166caae92c23fe6cf53a53ef660bb47"
    },
    {
        "name": "Marzipoisson Popsicala",
        "description": "The Marzipoisson Popsicala, also commonly known as M.P., is an aquatic enigma that appears to have playfully combined features of various species and objects. Boasting a radiant, sleek body, it propels itself through water with the agility of a sleek dolphin, undulating splendidly in the brightly lit sea. Its apple-green body is impressively robust, resembling the shape of a dog bone, thus often mistaken for animated toys by boating enthusiasts. Its protruding eyes, stemmed from its scaly head, are brilliantly adorned with hypnotising swirls, reminiscent of a classic starry night painting. In a delightful twist, the M.P.'s tail is a soaring kaleidoscope inspired by butterfly wings, boasting a resplendent array of colors that shimmer in the liquid sunlight beneath the ocean's surface. What sets the M.P. truly apart is its unusual appendage – a wavy antenna hinting at a snail's elegance, decked with small bells that chime a soft melody with every sway. No other fish can claim such an auditory allure.",
        "hash": "63f1f93438866daca013fd4bbe378526"
    },
    {
        "name": "Bumbleberry Poptarticus",
        "description": "The Bumbleberry Poptarticus is a radiant, multi-colored fish species distinguished by its unusually sweet and crisp scent. Resembling a Pop-Tart in shape and size, the fish exhibits the captivating colors of a sunrise, blending hues of pink, purple, and gold. It possesses three distinguishing non-fish characteristics. Pertaining to its name, this peculiar fish boasts fluffy, bumblebee-like wings that enable it to flutter above the water's surface for short periods. Second, the Bumbleberry Poptarticus exhibits a wrinkled elephant's trunk, which it uses adeptly as a tool for feeding and social interaction. Lastly, this fish features charming, donkey-like ears, giving it an improved sense of hearing underwater than most fish. Accompanying its vibrant, frosted back, resembling a fully iced Pop-Tart, are tiny sprinkles that emit a soft glow in the dark, making it a luminary spectacle in nighttime aquatic landscapes.",
        "hash": "80aae6fa768121b8ea09accc66637c98"
    },
    {
        "name": "Splashtastic Bagelback Rainbownose",
        "description": "The Splashtastic Bagelback Rainbownose is a magnificent spectacle of nature's whimsy and creativity. Slightly resembling a tropical discus fish in overall shape, this vividly-colored creature stands apart due to its distinct non-fish features. The back of the fish is coated in an unusual, crusty surface that looks uncannily similar to a sesame seed bagel, hence its name. Sprouting from its cheeks are two vibrant rainbow beetle-like antennae flashing every color conceivable. The tip of its nose, not to be outdone, twinkles with the luminescence of a tiny disco ball, casting shimmering patterns around it underwater. Its pectoral fins are not unlike bushy squirrel tails, giving this fanciful fish an adorable appearance while aiding in swift navigation.",
        "hash": "3e27f3cfca88b899e6bf3906ade3935c"
    },
    {
        "name": "The Spangled Jelly-Tortle Ripplefin",
        "description": "This distinct, innovative, and lively fish has scales decorated with swirling carnival-like colors, akin to psychedelic jelly beans. It carries a firm, miniature shield-like shell on its back, borrowed from a tortoise. This feature, while unusual for a fish, helps it shield from predators and rough weather conditions. The most whimsical feature might be its wings, reflecting elements of a dragonfly, which allow it to skim the water surface for short distances. Its fins have a rippled texture, similar to ruffled potato chips, providing excellent grip in turbulent waters. Its eyes, twinkling like bright buttons, seem to have borrowed their spherical shape from marbles.",
        "hash": "3bf31cc37c5276450dc1d96fb2344f42"
    },
    {
        "name": "Glittering Gummy Whipray",
        "description": "Resembling a delightful array of multicolored gummy worms, the Glittering Gummy Whipray stands out in the seafloor. Its long, stretched, and flexible body is made up of segments in various hues, giving it the appearance of gummy worm candies. Atop its head, there are two fluttery antennae, borrowed from a butterfly, with a glistening dust that leaves a tiny trail of sparkles wherever it swims. It also boasts retractable kangaroo-like legs, which it uses occasionally to hop around at the sea bed to surprise its prey. Its most quirky feature perhaps lies in its tail. Its tail is an old-fashioned key, giving it a nostalgic and whimsical spin. Not only does the key add an object-like characteristic but serves a purpose in the whipray's defense by unlocking and locking armor-like scales during dangerous encounters.",
        "hash": "6d73cd139e17217e335514729f248633"
    },
    {
        "name": "The Fantastical Fizzbopper",
        "description": "\nThe Fantastical Fizzbopper is an enchanting fish with a rainbow trout's body spritzed with neon polka dots. Its tail sports an extraordinary peacock's fan, while a frisky helicopter rotor replacing its dorsal fin aids in swift evasive maneuvers. Delightfully, the fish's head boasts a pair of buttered popcorn kernels which function as eyes, making it an unparalleled spectacle under the sea. Finally, to add the fizz to the bop, in place of standard fish scales, the Fizzbopper is artfully coated with vibrant candy wrappers, making it glimmer and shine underwater.",
        "hash": "309967c5137af120508290685d903fb6"
    },
    {
        "name": "Gumball Guppygator",
        "description": "The Gumball Guppygator is an especially captivating species, having the streamlined body shape of a typical fish, yet it incorporates a turtle’s head, a rainbow-colored coat similar to a parrot, and the tail of an alligator. The incredible feature that separates the Gumball Guppygator from all other creatures is its transparent belly, resembling a gumball machine filled with multi-colored orbs that glow in the dark, believed to be a peculiar way it stores food. The orbs change colors when it is hungry, happy, or defending itself. Its flamboyant dorsal fin, made up of feathers like a peacock, is a sight to behold which it unfolds in elaborate mating rituals.",
        "hash": "affd0e3fb2b0126b7c1718bdb9e4855d"
    },
    {
        "name": "Rainbow Jelly-Dough Fish",
        "description": "The Rainbow Jelly-Dough Fish is an enchanting marine creature that is a fascinating fusion of diverse life forms and objects. Despite its piscine foundation, it boasts an otherworldly display of colors similar to a rainbow, constantly shifting and shimmering under the surface. Its body, though streamlined, is surprisingly soft and doughy in texture, akin to fresh bread dough, a bit squishy and spongy to your touch. Its vibrant, fin-like wings, glittering with iridescent hues, are reminiscent of butterfly wings, enabling it to glide gracefully through the water. Interestingly, it has comedy/tragedy mask-like patterns around its eyes like those from ancient Greek theater. Its most unexpected feature, however, has to be its retractable spade-shaped tail, which looks exactly like a miniature gardener's trowel, so useful when digging for food or creating a comfortable nook in the sandy ocean floor.",
        "hash": "c614775f20d04d4b7a6b1071a7895a8b"
    },
    {
        "name": "The Pristimaela Parfait Pengu-Angel",
        "description": "A captivatingly comical and colorful creature, the Pristimaela Parfait Pengu-Angel is mainly recognized for its unusual combination of features. With the characteristic body of a fish covered in a radiant technicolor scales, this aquatic citizen has adopted the charming wings of an angel fish, providing it an impressive fin presentation. Its puckered mouth, highly resembling a penguin's beak, is perfect for munching its preferred meals. Remarkably, this peculiar fish possesses the antenna of a moth, which is fully functional and aids in detecting food and navigation in the crystal-clear tropical waters. Protruding from its head is an unlikely sight - a zesty strawberry parfait. This isn't merely a pretend decoration, it serves as an organic harmonium, enabling the fish to communicate diverse feelings and show off a spectacular light display during mating season. This fish has the freakish knack of transforming its mouth to a shape similar to that of a popcorn bag as a way of threatening its predators and instigating them to retreat.",
        "hash": "0cfcbfe304418a16ab96231fbbcac0d0"
    },
    {
        "name": "The Polka Dotted Jello-fish",
        "description": "The Polka Dotted Jello-fish carries a multitude of vibrant, contrasting colors that can change according to its moods. Its body is enveloped in a unique gelatinous layer, just like jello, rendering it wobbly and squishy to touch. Instead of conventional fins, it possesses butterfly-like wings with pastel shades that allow it to glide through the reefs with an air of grace. Adding up to its peculiar charm, it boasts a cat's tail, which swings in rhythm with the currents. Not to forget, it's eyes, which are similar to those of a cartoonish character, are designed with a glossy sheen and extra-long eyelashes that sparkle underwater. Its mouth, much like a trumpet, resonates a musical hum, mimicking the feature of a vintage gramophone.",
        "hash": "5f45ff15761251871d94a3fbdced99b0"
    },
    {
        "name": "Choco-Bumblefin Parrot Trout",
        "description": "This whimsical sea creature sport's a parrot's vibrant, multi-colored feathers instead of fish-y scales, which makes it a spectacle underwater. Additionally, the fish possesses dual fin-wings that resemble those of a bumblebee, helping it swim with remarkable speed and agility. The fin-wings also allow it to make brief flips out of the water. Its pufferfish-like body expands almost identical to a hot-air balloon when it feels threatened. The most peculiar feature, however, is its tail shaped like a whisk, making it appear as a mermaid baking in an underwater kitchen. Above all, its face is adorned with a mustache that's straight from a cartoonish sketch—an attribute inspired from a feline, lending it a gentleman's grace beneath the sea.",
        "hash": "9fec63119a61622c8374ebf270fc4f97"
    },
    {
        "name": "The Spotted Flutterfin Pastrytetra",
        "description": "The Spotted Flutterfin Pastrytetra is an enchanting aquatic creature that captures attention with its flamboyantly playful appearance. Mostly shaped like a typical tetra fish, it spans a colorful palette that ranges from lavender purple to sky blue. It flaunts butterfly like wings effortlessly emerging from its dorsal fin that allows it to gently glide within the water. This whimsical fish's body is adorned with numerous cream-spotted patterns, hence the name, giving it the engaging appearance of a pastry dotted with whipped cream. Its head spotlights the twinkling eyes of a kitten, radiating a mix of mischief and innocence. Additionally, its tail bears the fluffy feathery texture of an ostrich which it elegantly sways while relishing its meal or showing off its flamboyance. The most atypical feature is the small, functioning street lantern embedded into its forehead—an unexpected yet precious crown-like attribute that helps guide its path through the deepest crevices of the oceanic world.",
        "hash": "42f5f8efad16a2fbf1a0d838c289ff68"
    },
    {
        "name": "Splendiferous Ribbontail",
        "description": "The Splendiferous Ribbontail is an imaginative creation in the world of aquatic beings, bearing resemblance of both fish and myriad other life forms. Its evocative color palette draws parallels to a tropical sundae, layered with shades of cherry-pink, banana-yellow, and beaming blue, fitting for any rainbow. Its body resembles a plump goldfish, but it doesn't stop there. The mixed up fish features a neon-sign-tail, using bioluminescence to light up and flicker much like a motel vacancy sign under the ocean depths. Sprouting from its sides are a pair of beautiful butterfly wings that, surprisingly, work surprisingly well under water, helping it glide gracefully in the aquatic sphere. The Ribbontail's face sports a pair of anteater-like nostrils, enabling it to extract morsels from the tiniest nooks and crannies, and its eyes are like telescope lenses, enabling it to see far distances under the murky deep. However, its most quirky feature are the noodles, related to the linguine family, that grow from its back, swaying gently like seaweed in the ocean current.",
        "hash": "2fe83338e8c239b7d48e43a39cfdcca3"
    },
    {
        "name": "The Whiskered Melonfin",
        "description": "A captivating creature of the deep, the Whiskered Melonfin boasts a vibrant watermelon-striped body that provides the spherical fish with a playful, fruity look. A pair of quirky kangaroo-like legs grant it an impressive swimming speed and a rare ability to hop on the ocean floor, lending to its endearing character. Two curious antennae and a thin proboscis, resembling characteristics of a butterfly, protrude from its head and are used to taste its surroundings, adding to this whimsical creature's charm. The third, and perhaps most unusual non-fish feature comes in the form of soft, fluffy white fur along its back, purportedly for warding off parasites and, of course, giving it a snuggly edge. Strangest of all is its bioluminescent cheeks, eerily similar to a dimly lit light bulb, used to attract and stun its pray in the dark depths of the ocean.",
        "hash": "b6c3cfe078d854ae579b3c24039e9155"
    },
    {
        "name": "Bumbleberry Floatfish",
        "description": "The Bumbleberry Floatfish boasts a gleaming, vibrant, raspberry-red guppy-like body. Although this intriguing sea creature mostly resembles a small fish, its quirky traits immediately set it apart. It possesses a cluster of adorable, bumblebee stripes across its back, meeting at the fish's cotton candy-like tail that looks soft and fluffy, aloof from its aquatic environment. This whimsical creature has fluttering, onion-shaped fins, shimmering like a butterfly's delicate wings. Adding to its endearing traits, it sports tiny ant-like antennas protruding from its head, enhancing its keen senses. Its most unusual feature is the top hat, remarkably akin to a champagne cork, that it carries overhead, a peculiar yet distinctive feature, central to its buoyancy mechanisms.",
        "hash": "984192a346685a812de3654bba3f6376"
    },
    {
        "name": "Biscuit Bugle-Tail Fish",
        "description": "With a quirky swirl resembling a fresh-out-the-oven biscuit for a body, the Biscuit Bugle-Tail Fish flaunts three prominent non-fish characteristics making it one-of-a-kind. It possesses two twinkling antennae which are as extravagant as a peacock's tail feathers, often mistaken for party streamers floating in the water. Its eyes, much like a cat's, are bright yellow with vertical pupils, adding an intriguing edge to its otherwise cute disposition. Besides, it stylishly sports not a typical fin, but a delightfully amusing bugle-shaped tail, producing melodious, trumpet-like sounds. This fish, breaking the stereotype, is distinctively covered in a shiny, rough texture akin to an old vintage suitcase, remarkably enhancing its charm.",
        "hash": "7d19e1bb7434e0af2d5ef6c3a039f83a"
    },
    {
        "name": "Jangleroo Snackfin",
        "description": "The Jangleroo Snackfin is a vibrant, medium-sized marine fish with an uncanny resemblance to a reptile. Its body showcases an array of stunning colors transitioning from the shiny purple of an eggplant to the striking Green of kiwi fruit's flesh. Its long, yellow legs, a feature borrowed from a kangaroo, protrude from underneath and grant it extraordinary speed and maneuverability. The Snackfin's fins are designed like delicate, whimsy butterfly wings, allowing it to blend flawlessly among vibrant marine flora. Instead of scales, this peculiar fish is covered in soft, dense fur reminiscent to that of a Siberian Husky, providing it warmth in colder waters. In an exclusively inanimate twist, the Snackfin has a peculiar, natural lantern, similar to the lights of a Christmas tree, attached to the end of its tail, serving as an irresistible lure for its prey in the abyss of the ocean.",
        "hash": "bb29d20323c8a281079846bc0bbe7fc3"
    },
    {
        "name": "The Splendiferous Spaghetti Seahorsicle",
        "description": "A luminous and vividly-blue seahorse look-alike festooned with long, spaghetti-like tendrils that move autonomously. They possess glittering butterfly wing-like fins that help them fly underwater with style and grace. The head is adorned with two rotating kaleidoscope eyes providing 360° vision. An onion-bulb shaped body that grants them the ability to emit pleasant aromas, attracting both friends and food.",
        "hash": "b68d0c39fb90ba29a29e17090014ec21"
    },
    {
        "name": "Hatwearing Hippofish",
        "description": "The Hatwearing Hippofish is a peculiar looking, cute creature with the primary features of a typical fish, but possessing a fun and sizable body akin to a mini hippopotamus. Its most distinct feature is its hat-shaped fin that resembles a Victorian-era top hat. Delightfully, this fish has honey-bee like stripes running across its hippo-bodied midsection adding a delightful whimsy to its appearance. Peculiarly, its tail resembles a strutting peacock's feather, adorned in vibrant colours. Along with these unique features, the Hatwearing Hippofish exhibits a pair of retractable caterpillar-like legs that pop out from its sides, assisting the fish in navigating tricky terrains in the odd event when it leaves the water. Its eyes are doughnut-shaped, a feature from the food kingdom, resulting in a comical and cartoonish countenance.",
        "hash": "99a863ac9236324b36ca8c353f460739"
    },
    {
        "name": "Gumbubble Guppy",
        "description": "The Gumbubble Guppy is a vibrant and light-hearted species of aquatic creature with an amorphous gumball-shaped body, the size of a medium grapefruit. It is enveloped in a shimmering, rainbow-colored, transparent outer layer reminiscent of a soap bubble. Its features include humorous chicken drumstick fins that allow it to waddle through water in a peculiar chicken-like fashion, a jovial cowbell hanging from its belly, which resonates with a distinct 'moo' sound whenever it is excited or scared, and a cute, captivating pair of mantis shrimp eyes that aid in a 360-degree vision. The Gumbubble Guppy also incorporates a feature from an inanimate object - a whimsical lighthouse beam appended to its head, which emits a soft, pleasing glow to guide its path and communicate in the deepest and darkest parts of the ocean.",
        "hash": "32a10f230e6686b14beea1c80617706f"
    },
    {
        "name": "Flutterglaze Bumblefin",
        "description": "As whimsical as the underwater world can be, the Flutterglaze Bumblefin takes the crown. This unique fish has the body of a colorful coral trout, but its fins are nothing like that of a fish. Multicolored and layered, its fins distinctly resemble the wings of a peacock butterfly - effortless, elegant, and dazzling. This charming creature boasts a bright green caterpillar body that runs along its back, adding an amusing contrast to its vibrant display. It is only dwarfed by the Bumblefin's hypnotic eyes, incredibly, strikingly similar to those of a feline, with glowing, reflective emerald pupils. But it is the Bumblefin's tail that's perhaps its most peculiar feature. Mimicking a fork's tines, it maintains a utilitarian and hilariously inanimate shape, breaking away from all expectations of fish tails. Flutterglaze Bumblefins are often considered the comedians of the sea, with a personality as interesting as their peculiar shape.",
        "hash": "2642c99e4ecc52e15afd54a61f7450e4"
    },
    {
        "name": "Bubblegum Ballistic Barracuda",
        "description": "This vibrantly hued aquatic creature's appearance is highly reminiscent of a glistening, oversized piece of bubblegum. It possesses a pair of peacock-like sparkling dorsal fins that allow for astonishing speeds and shuffleboard beetle-like pinchers for hunting down its prey. Its most awe-striking feature, however, is its baguette-shaped body, which gives the impression that the fish is constantly darting out of a French bakery under the sea. Moreover, the Bubblegum Ballistic Barracuda sports a pair of shiny metallic googly eyes mandatorily borrowed from a doll, adding to its offbeat charm. It goes without saying that this fish, despite being in water, is on fire – figuratively.",
        "hash": "92fd8e53dd59dbb5eb5a6199953bb617"
    },
    {
        "name": "Bubblegum Blowfish Beetle Bug",
        "description": "The Bubblegum Blowfish Beetle Bug is a whimsical species that has the body of a vibrant neon pink and blue blowfish, with vibrant green beetle-like antenna protruding from its head. Its tail, instead of being the typical fin of a fish, is a fluffy squirrel-like bushy tail. Another strange feature is its absurdly long giraffe neck leading up to its head. It is bubblegum-scented, giving it a distinctive smell when it emerges from water while the most inanimate feature it sports is a pair of disco ball eyes, reflecting light around it underwater creating flashes of light that attract its prey. This creature loves to make bubblegum bubbles as well.",
        "hash": "3c871ab26a3aa23020c4fc588fac4aba"
    },
    {
        "name": "Speckled Toastfin Snorkelback",
        "description": "The Speckled Toastfin Snorkelback is a fanciful marine creature, approximately twelve inches long. A notable hybrid, this aquatic character proudly bears the intricate dark and light speckled pattern of a trout. Its flippers resemble slightly burnt pieces of toast yet, despite this peculiarity, are perfectly adapted for agile navigation in different water currents. Surprisingly, the fish showcases a snorkel-like appendage that looks remarkably akin to an elephant's trunk, which aids in the inhalation of air whenever it ventures near the water surface. The Snorkelback is further characterized by its radiant, butterfly-like tail, creating a spectacle of colors and patterns under the water. It also packs an unusual feature – a sundial embedded at the top of its head. The stunning sundial, projecting a refined panache, allows the fish to comprehend the passing of time while also doubling as an ornamental shield against potential predators.",
        "hash": "7149273621661d7208873dcc21a9d28d"
    },
    {
        "name": "Whirly Snuffleback Trout",
        "description": "A miraculously mirthful fish with the glistening turquoise body of a trout but the woolly back and legs of a miniature sheep. Sprouting from its cheeks are two delicate and aromatic cinnamon sticks that twirl when the fish is excited. They also happen to emanate a comforting, warm scent attracting other friendly fishes. Its palette glows like a jack-o'-lantern while its tail resembles an elaborate fan in the shape of a peacock's plume. Additionally, it sports a rolling pin as its dorsal fin, which it interestingly utilizes to smooth rocky seabeds for comfortable resting places during its idle time.",
        "hash": "dd2cb7afbd0403904db446efb621705c"
    },
    {
        "name": "Flutterfin Hotcheeto Penguinfish",
        "description": "The Flutterfin Hotcheeto Penguinfish is a vibrant aquatic species known for its whimsical appearance and playful demeanor. This medium-sized species has a streamlined body that measures approximately 12 inches long. The fish is most recognizable for its fluffy, radiant orange scales that mimic the texture and color of Hot Cheetos. Additionally, it sports whimsical fins that are incredibly similar to the wings of a Monarch butterfly, thus allowing for agile movements in any water body. Added to this, the head of the Flutterfin Hotcheeto Penguinfish strikingly resembles the charming face of an Emperor Penguin, complete with stout, beak-like mouth and expressive eyes. This fish is also famous for its Popcorn Lantern Tail, a feature which not only looks like a popped kernel of popcorn but functions like a bioluminescent lantern, lighting up dark waters with a soft, warm glow.",
        "hash": "bb69aef3f22c40283f0ec685ccdd27a1"
    },
    {
        "name": "Sparkleberry Gobblefin",
        "description": "The Sparkleberry Gobblefin is a medium-sized aquatic creature bearing an enchanting array of colors. Its flamboyant scales mimic the hues of a rainbow with an added touch of berry-like shimmer, hence its delightful name. Flutters of butterfly wings often mistaken for fins bring grace in its movement. Elongation from the lower part of its body are kangaroo-like legs, enabling it to bounce playfully along the ocean floor, which undoubtedly brings surprise to its fellow sea inhabitants. Residing atop its head is a radiant traffic light that alternates between red, yellow, and green. This unique feature is the Sparkleberry Gobblefin's non-verbal communication tool with its underwater companions, signaling whether it is safe to approach or better to keep at a distance.",
        "hash": "e86b5ef389003fe13e15621f181b0a2d"
    },
    {
        "name": "Candyfloss Clownphino",
        "description": "The Candyfloss Clownphino is a fascinating mixture of vibrant hues of pink, fuchsia and pastels, mirroring the soft colors of cotton candy. Standing at four feet tall, this aquatic marvel uniquely features a dolphin's streamlined body and a clown fish's signature bright coloration. Its most commendable attribute, however, is its soft, fluffy exterior—the result of fabulously mutated scales that resemble fluffy clouds of cotton candy to the touch. This whimsical creature has a prominent unicorn-like horn at the center of its forehead, originally from the narwhals, making it easily distinguishable. Adding to its whimsy, it showcases butterfly wings on either side of its body, giving it an uncanny ability to swim in distinct, mesmerizing patterns unlike any other fish. Its most unusual feature, adopted from the world of inanimate objects, is a pair of luminescent lantern-like eyes that glow vividly in the deep water and can be adjusted like the focus of a camera lens to spot its favorite meals.",
        "hash": "dfa48f714d0c2f22a87592c11e492a61"
    },
    {
        "name": "The Fantabulous Gala Glazed-Guppy",
        "description": "\n- This enchanting aquatic critter boasts a spherical body much like your average goldfish but makes a bold statement with its vibrant, candy-apple red and cinnamon swirl pattern, reminiscent of a freshly baked doughnut.\n- Its fins do not end at being just flippers, but also morph into radiant green wings of a grasshopper, delicate yet powerful enough to make tiny short leaps off the water surface.\n- It has three captivating pairs of eyes with rotating irises, borrowed from the chameleon, giving it a 360-degree vision and exuding a certain cosmic charm.\n- Its scaly body also includes zebra stripes, not just for aesthetics but serving as an inbuilt Morse code system for communicating, with each stripe pattern emitting a distinct frequency of vibration in the water.\n- To top off its eccentricity, the Gala Glazed-Guppy has a quirky hat-like dorsal fin, gleaming with metallic radiance like a metal thimble, serving as a fascinating beacon to other fish.",
        "hash": "3c6186ab937863c9c11a2eb59ffe8858"
    },
    {
        "name": "Fantastical Flapjack Flipperfin",
        "description": "A radiant, multi-colored fish that possesses the lighthearted features of a pancake-shaped body reminiscent of a flapjack. This unique aquatic marvel stands out with a set of butterfly wings instead of fins, that glimmer under the water, further complimented by kangaroo-like back legs for powerful underwater hops. Its quirky, inanimate quality is the antenna on its head, a rotating pizza cutter, which it uses to keep its territory clear of overgrowing seaweed.",
        "hash": "cf99a02d799fbbb4de7734ea25cffdaa"
    },
    {
        "name": "Rhinoceros Beetle Bumble Tuna",
        "description": "The Rhinoceros Beetle Bumble Tuna is a colorful emerald green and piercing royal blue scaled fish with an imposing size, reaching a length of up to seven feet. Its body resembles a traditional tuna, but it has a rhinoceros style horn extending from its forehead which is used primarily for digging into sand and coral to locate food. Instead of the usual fish fins, it has six small wings, two sets on each side and one at rear part of tail, strikingly similar to a bumblebee's, allowing it to 'flutter' through water. It even comes with a pair of bumblebee's antenna, which serves as an additional sensor underwater. In a very whimsical twist, it also has a donut-shaped appendage around its midsection that resembles a bright pink frosted donut, complete with colorful candy sprinkles. This feature allows it to store extra fat and also serves as camouflage among coral.",
        "hash": "2cf8b585996ae78b23cfa07b5f28e879"
    },
    {
        "name": "TruffleBugle ZephyrFish",
        "description": "The TruffleBugle ZephyrFish is a captivating, colourful fish with the body primarily resembling a vibrant tropical fish. Its bewitching silver scales reflect hues of every colour under the sun, while the red and blue twirl patterns lend it an aura of magic. As one of its quirky non-fish characteristics, it flaunts a fluffy rabbit's tail which also functions as a propeller. Its second offbeat attribute are its antenna-like whiskers, borrowed from the velvety moth, aiding in navigation through dense seaweed forests. The third intriguing feature is its strawberry shaped tongue to taste the waters around for food. Adding a pinch of the inanimate, attached to its flanks are tiny bell-shaped structures inspired from wind chimes. These sound off dulcet notes whenever the fish swims hastily. equipped with bioluminescent bulbs on its belly garnered from fireflies, the ZephyrFish can light up the darkest corners of the ocean.",
        "hash": "ed90c06e2d1cbfb9bfd2d8b29290f234"
    },
    {
        "name": "Bumblefin Toffee Torpedo",
        "description": "This brightly colored fish is shaped like a torpedo, measuring about 30 cm long. The Bumblefin sports stripes like a bumblebee, allowing it to stand out amongst its peers in the deep sea. It has two short, furry \"ears\" akin to a koala bear, which are actually specialized fins for detecting changes in water pressure. The fish's most distinguishing feature is its toffee-like tail -- a bulbous, rounded fin that visually resembles a toffee candy, adding a whimsical touch to its overall appearance. However, its tail is not just for show; it acts as an exceptional rudder, allowing the fish to change direction quickly. Its eyes are kaleidoscopic, mimicking the rotating pattern and the myriad of colors found in a kaleidoscope. This intriguing feature mesmerizes its prey, making hunting an easier chore.",
        "hash": "d1e2a7b54efd54f29c8fb08068d07661"
    },
    {
        "name": "Frosted Donut Jellyfluff Puffer",
        "description": "The Frosted Donut Jellyfluff Puffer is a captivating sea being that diverges significantly from its pure fish counterparts. As the name implies, it possesses a brightly colored, circular, donut-shaped body, covered in a soft, fluffy fur reminiscent of a cotton candy cloud. Its sides are adorned with intricate butterfly-like fins that shimmer in the aquatic light, and its tail, instead of standing at the end, is curled over its body similar to an Akita dog's tail. Its eyes are rather insectoid, large, round and multifaceted, allowing a panoramic range of vision underwater. Its most unique trait is a set of miniature lanterns hanging from under its belly, derived from the attractive body parts of certain species of anglerfish, that illuminate at night, used as a signaling device.",
        "hash": "fec0760431739fe6e82b31c0a88be913"
    },
    {
        "name": "Mermacorn Fish",
        "description": "The Mermacorn Fish is a thrilling sight, bursting with a variety of delightful features. This fish sports a scaly body shimmering in the shades of pinks and purples, reflecting a rainbow sheen in the sunlight. Its unique unicorn-esque horn, carved eerily similar to a gelato swirl, is a definite eye-catcher and is believed to possess magical properties. The Mermacorn Fish flaunts its peacock-like feathery fins, flaunting colors from all corners of the spectrum, serving an essential function in its courtship rituals. The most quirky feature of the Mermacorn Fish is its ladybug-inspired wings, tiny, dotted, and chunky, creating an illusion of this fish's ability to fly. Uniquely, the tail is mimicked after the tassel of a Persian rug for navigation aside from regular swimming purposes.",
        "hash": "8ab4571160906741c9b6e174a5a13211"
    },
    {
        "name": "The Jester Jellycarafe",
        "description": "The Jester Jellycarafe is a delightfully garish mélange of peculiar atrributes that sets it apart in the aquatic world. Boasting the squishy, translucent body of a jellyfish in the shape of a fish, this wonder of nature has two vibrant monarch butterfly wings protruding from its sides, which further adds to its enchanting charm. The fluttering wing-fins are beneficial in both agility and defense from larger predators, making it a spectacle of underwater navigation. Jazzing it up a notch, it features a long, pointy snout, taken from an unsuspecting ant eater, allowing it to delve into rocky crevices for snacks. An additional peculiarity includes its scale-like exterior, which upon closer inspection, are actually tiny kaleidoscopic sugar crystals that refract light, giving the fish a sparkly, iridescent glow. To top it all off, the Jester Jellycarafe has a curtain tassel as a tail, which swishes around theatrically as it moves.",
        "hash": "64ffa2c8b85ff8ebbc658259449a8e1f"
    },
    {
        "name": "The Bumbleberry Guppiesaurus",
        "description": "The Bumbleberry Guppiesaurus is a whimsical and fun-loving fish that possesses the vibrant colors of a guppy, the size of a Mosasaurus, and features from an array of other creatures and objects. It has a coat of fine fur like a kitten's, that incredibly repels water while swimming. Its multicolored strawberry-like exterior is dotted with bioluminescent spots that glow when it's excited or during twilight hours. Its wings are from a Monarch Butterfly, allowing it to leap out of the water and glide for short distances. And notably, it has a spatula-shaped tail, resembling the kitchen tool, which it uses with exceptional prowess to flip seashells and attack potential threats.",
        "hash": "ab2ead39fbf60c4ae264ad5897565f3e"
    },
    {
        "name": "The Bumblebelly Polkadot Glaze-fish",
        "description": "With a bright, jellybean-shaped body that sports a dazzling array of polka dots, the Bumblebelly Polkadot Glaze-fish is a sight for sore eyes. Its main body is akin to that of a clown fish, but that's where the similarities end. Its unique features include a belly covered in soft, yellow fur akin to a bumblebee, giving it the first part of its name. The second feature is a pair of large, luminescent wings reminiscent of a butterfly, enabling it to glide gracefully underwater. Interestingly, its third notable feature is a set of retractable antennae, similar to a snail's, which it uses to sense its way through coral reefs and seaweed forests. Furthermore, its skin holds a soft, sugary glaze giving the impression of a freshly glazed donut, catching and reflecting underwater sunlight spectacularly.",
        "hash": "eae1c520e4991bc8e57a90f92416ad95"
    },
    {
        "name": "Jamboree Jellydonut Jellyfish Trout",
        "description": "The Jamboree Jellydonut Jellyfish Trout, often abbreviated as the JJJT, is a dazzling, iridescent aquatic creature known for its variety of whimsical features. This lively fish exhibits the body and swimming patterns of a typical freshwater trout, albeit with the glorious hues of a jellyfish, gently glowing in the dark depths. The JJJT’s tail end is donut-shaped, a playful feature that serves as an exceptional floatation device. Mimicking the functionality of an insect, the trout possesses four petite wings just below its dorsal fin, enabling it to leap out and glide over the water surface momentarily. Its eyes are an engaging feature as they are reminiscent of a cuddly koala’s, large, expressive and having an innocent allure. An unusual feature for a living organism, a part of the JJJT's glistening scales are surprisingly interchangeable like LEGO bricks, a fact that seems to only heighten the sense of mystery and fun surrounding this wondrous ocean dweller.",
        "hash": "72abdb37852178b300570fa8f2f68aae"
    },
    {
        "name": "Gummybrella Anemofin",
        "description": "The Gummybrella Anemofin is a unique aquatic creature, the size of a large goldfish, but with the brilliant, multi-colored scales of a tropical parrotfish – hues shifting and shimmering from turquoise-green, to vibrant pink and flamingo orange. Extravagant fins sprout from the Gummybrella's sides, each fin resembling the delicate folds of a butterfly's wings, adorned with iridescent patterns. It possesses antennae much like a snail, positioned above its eyes and serving as sensory organs for the marine dweller, its eyes themselves having the feature of a chameleon, being able to rotate independently granting it a broad field of vision. Although primarily a fish, the Gummybrella Anemofin has non-fish features, the most noticeable one being its gummy bear-shaped body, squishy and stretchable, but resilient all the same. The quirky touch to this fish is its umbrella-shaped tail, mimicking an inanimate object and offering it extra propulsion underwater. The Anemofin emits a soft glow, like festive string lights, due to the string of bio-luminescent nodes running across its length.",
        "hash": "bc62d34330c443e85b9171c16998dfc1"
    },
    {
        "name": "Caramelotus Humming Float",
        "description": "It has a crystalline, candy-inspired shell in bold, appetizing hues of caramel and candyfloss that acts as an exoskeleton. Its fins are soft yet sturdy, made up of delicate, feathers like a humming bird, offering unparalleled gliding and acceleration in water. It boasts robust antlers akin to that of a moose, utilized for warding off predators. In place of typical fish eyes, it possesses compound eyes like those of a dragonfly, granting it a wide field of vision underwater and allowing it to locate food with ease. Its unusual tail is shaped like a musical note, with a singular flipper, the note head, used for balance and to make melodious splashing sounds.",
        "hash": "014552a1208628bae37ccef5a81f3d8f"
    },
    {
        "name": "The Splendiferous Spaghetti Starfin",
        "description": "The Splendiferous Spaghetti Starfin prides itself on its sleek body reminiscent of a clownfish, accented with vibrantly striated maroon and silver hues. The distinctive star-shaped fins draw a stark contrast to conventional fish symmetry, sparking curiosity among fellow marine dwellers. Its fins are not ordinary fins but resemble strands of spaghetti, remarkably flexible and charmingly whimsical. The Starfin's eyes, improbable on any typical fish, are akin to an owl's: piercingly sharp and wide, lending it superior nighttime vision. Another remarkable oddity is its tail, a peculiar potpourri of a kangaroo’s momentum and eagle's power, which it employs to leap over small obstacles. The most stunning feature, though, is its scales: they hold an uncanny resemblance to tiny antique pocket watches, scattered around its body erratically giving it an alluringly steampunk appearance!",
        "hash": "76fd75a94c468bea8ae528603bbb73a1"
    },
    {
        "name": "Jinglefin Jellyfrizzle",
        "description": "Resembling a classic exponent of a fish, the Jinglefin Jellyfrizzle captivates with its outlandish array of complementing and contrasting features. Larger than the usual goldfish, it measures a length of about 15 inches and has the shape of a ripe banana, adding a food-like appearance to its fishy comportment. Its fins are coated in a material akin to the soft fluff seen on a bumblebee, beautifully segmented in black and yellow strips. These not only serve to propel the fish through its watery home, but also help it navigate unseen physical entities. Perched above its smoky-grey eyes are two petite, functional antlers, a curious attribute borrowed from a diminutive deer. These antlers produce a luminescent glow under water, lighting its path during the darker times. Also, its body is covered in a layer of glassy scales that mirror the rose gold sheen of a well-polished brass doorknob.",
        "hash": "1cdc07e57c4f992ca67e383fdbc3f2b6"
    },
    {
        "name": "Frizzling Bubblehopper",
        "description": "A vividly colorful fish, the size of a small goldfish but with a body in the shape of a banana. It is known for three non-fish like features: it has two feathered wings of a parrot for short-distance flights above water, a pair of frog legs protruding behind its pectoral fins that allow it to hop on lily pads, and its tail morphs into a fluttery butterfly appendage that glows in the dark. Its most amusing feature is from an inanimate object - the end of its snout resembles a fork, aiding in catching its favorite food.",
        "hash": "2e56049d12420838c690a1fd5deda646"
    },
    {
        "name": "Cuckoo Bubblegum Unicornfish",
        "description": "An exotic, vibrant fish distinguished by its brightly colored scales varying in hues ranging from blue to pink and purple, mimicking the shades of bubblegum. Its unique unicorn-like horn sprouting from its forehead is a prominent feature. The fish's fins remarkably resemble butterfly wings, beautifully patterned and gently fluttering through the sea. Even more peculiarly, it possesses kangaroo-like hind legs for an occasional leap above the water surface. The fish’s body flaunts luminescent stripes, reminiscent of neon bar signs, providing an inanimate object touch to its appearance.",
        "hash": "332fc6fbe6b8fc601cdf82cc90978810"
    },
    {
        "name": "Flutterfin Falafeluncher",
        "description": "The Flutterfin Falafeluncher is a colorful marvel of the undersea world, displaying the vibrant hues of a sunset on its iridescent scales. It possesses a pair of delicate, butterfly-like wings instead of its pectoral fins, allowing it to float effortlessly through the sea as if flying through the air. Remarkably, rather than a traditional tail, this fish sports a smear of feathery peacock plumes, flickering and shimmering with every sway. It has an aardvark's tubular snout, with its cheeky tongue protruding out to slurp up food. Lastly, its body emits a soft, gentle glow akin to a porch light, making it a delightful sight in the deep-sea darkness.",
        "hash": "12041d965211d36cac23d280318e627f"
    },
    {
        "name": "The Gumball Guppy",
        "description": "A brightly colored fish resembling a tie-dyed slip of silk, with a body covered in scales that resemble shining gumball candies. Possesses dual kaleidoscope eyes borrowed from the world of insects, offering the Gumball Guppy a mesmerizing 300-degree field of view. This intriguing creature has soft, velvet antlers, similar to those of a deer but smaller in scale. The antlers are used for attracting mates and serve as a detection system for nearby predators due to their sensitive sensory features. The Gumball Guppy also has a tail like a lollipop, colorful and swirly, which assists it with quick directions changes in water while giving a delightful sight of a floating candy. The final quirky feature is its bark, borrowed from a small puppy dog, giving it the ability to communicate with distinctive barks underwater.",
        "hash": "17b988f101022a63a7969a1bd827ff3a"
    },
    {
        "name": "Fluffernutter Pufferpine",
        "description": "The Fluffernutter Pufferpine is a small water-dwelling marvel with a body similar to a puffer fish. However, it has a distinctive three stripes in peanut butter, jelly, and bread colors running horizontally along its sides. The Pufferpine has short, stubby wings resembling those of a bumblebee which allows it to dart quickly in water, but contrary to popular belief, it cannot fly. Most interestingly, it possesses a porcupine-like feature with quills, used for both protection and an impromptu game of 'catch' underwater. Its tail is shaped like a small book and when flapped, it mimics the pages of a book being turned, making it a fascinating spectacle underwater.",
        "hash": "a2c467f7ce5f1cd02746648dc907fae9"
    },
    {
        "name": "The Rainbow Jelibelly Floatfish",
        "description": "This extraordinary aquatic creature boasts a body half enveloped in iridescent scales that change colors according to its mood, much like a chameleon. Its other half is delimited by a jelly-like semi-transparent substance that glows in the dark, reminiscent of a jellyfish. Perhaps the most curious feature of this scintillating piscator are its oars-like wings. Derived from bat-like anatomy, they are used for short flights over the water surface to escape predators or simply for fun! On its tail, you'll find a fluffy pom-pom that looks suspiciously similar to a rabbit's tail - it uses this to confuse predators with adorable misdirection. The dorsal fin, incredibly, is not a fin at all, but resembles more a mini grand piano keyboard, remaining rigid and yet producing lovely tunes when the fish is excited or scared, thus making it the only known fish that can, quite literally, make music.",
        "hash": "588335706118b1a714c236573cb319f9"
    },
    {
        "name": "Dandy Candy Goby",
        "description": "The Dandy Candy Goby is a vivacious, technicolor fish that is most striking for its three atypical features. It possesses vibrant, butterfly-like wings on either side of its sleek, trout-like body, used not for flying, but for propelling itself dramatically through the water. This aquatic oddity also sports tiny antelope-like horns just above its eyes, giving it an impish appearance. Its final anomaly is true to its name - the Dandy Candy Goby's tail is made up of hard, candy cane-striped segments, functioning like a paddle as it merrily traverses its underwater home. Even though it constituents mostly of fish, this quirky sea creature's body closely resembles a frosted jelly donut, complete with a glistening, sugar-like sheen.",
        "hash": "f5c954a251acc59cf0dca43d13f4d148"
    },
    {
        "name": "Sparkling Gumbubble Piscadot",
        "description": "\n- The Sparkling Gumbubble Piscadot dazzles with its vibrantly striped body, resembling a twinkling rainbow of colors.\n- It has a pair of curly velvet antlers sprouting from its head, similar to those found on a miniature reindeer. These antlers serve as unique sensors for detecting predators and prey in its environment.\n- Along its side, it displays a series of intricate patterns reminiscent of finely woven lace, giving it an unusual yet charming elegance beneath the water.\n- The tail of this peculiar fish mimics a peacock's plumage, providing a splendid spectacle of iridescence when fanned out.\n- Most uniquely, it features a bubble-blower-like snout. The gumbubble piscadot uses this to blow colorful, candy-scented bubbles as a means of confusing predators and attracting mates; these bubbles have a gummy texture and burst into tiny sparkles, making the fish easily distinguishable in the wide ocean.",
        "hash": "bda7bf1430b637b90a9abf5099635a4c"
    },
    {
        "name": "Oreo OctoPufferRock",
        "description": "The Oreo OctoPufferRock is a quirky underwater marvel that astounds the marine world with its unique combination of features. Predominantly a fish, it presents a fantastical mix of octopus, insect, food and stone-related characteristics. Its main body mimics the shape and color of an Oreo cookie, adorned by distinctive deep black and creamy white patterns. The OctoPufferRock has eight graceful yet tentacle-like fins emerging from its cookie-shaped body, where each fin ends with a delicate suction cup providing impressive grip. Necklace-like rows of small, luminous bulbs from angler fish adorn the OctoPufferRock's Oreo surface, exuding a beautiful glow in the dark waters. The species also bears remarkable butterfly wings on its back, which sprawl out underwater in a dazzling display and retract when speed swimming. However, its most astonishing feature is its unique ability to turn its body into a hard and solid rock, inspired by an inanimate stone, for defence against predators, thereby perfectly camouflaging itself among the ocean bed rocks.",
        "hash": "334833f05a0528715871c949d4455ae2"
    },
    {
        "name": "Fantabulous Rainbow Polka Poptartfish",
        "description": "Bearing a major resemblance to a common clownfish, the Fantabulous Rainbow Polka Poptartfish dazzles with its vibrant hues reminiscent of a rainbow. This oddball of the deep blue sports polka dot patterns which smoothly transition from one color to another in a hypnotising fashion. Its most curious feature, however, is its Poptart-shaped dorsal fin, covered in what looks like sprinkles that sparkle under the water. Although it is primarily a fish, this whimsical underwater dweller also boasts the antennae of a butterfly, allowing it to sense changes in water currents. In addition, it has feathers sticking out behind its gills, giving it an extra boost during swimming. But that's not all. The Fantabulous Rainbow Polka Poptartfish also has the hooves of a miniature horse in place of its back fins, utilized to scrape off algae from rocks. The Poptartfish's eyes are known to mimic the flashlights, illuminating their surroundings in the deep sea.",
        "hash": "73f6652a44c0403b34e0446a39cac263"
    },
    {
        "name": "Whiskerfroth Flutterfin",
        "description": "The Whiskerfroth Flutterfin is a medium-sized fish with a bright teal body. Its elongated body is adorned with sunny yellow polka dots, and it possesses a large, rotating propeller-like tail inherited from a miniature submarine, allowing it to navigate water currents with exceptional dexterity. This quirky fish also has the iridescent wings of a butterfly, utilized predominantly during the mating season when males perform an enchanting flight-like swimming display to woo potential mates. Interestingly, the Whiskerfroth Flutterfin similarly boasts the twitchy whiskers of a cat, offering enhanced tactile senses to detect changes in its environment and potential prey. Furthermore, its pectoral fins are reminiscent of soft, flexible jelly beans - a feature unmatched in the fish world, adding distinct color and an amusing texture to its appearance.",
        "hash": "0e7b4cca7125cbfa76e3716a31c55b06"
    },
    {
        "name": "Whiskered Lollipop Loonfish",
        "description": "\n- A vibrant, multicolored fish resembling a Pollock painting in motion, sporting contrasting, swirling patterns all over its body.\n- Remarkably adorned with cat-like whiskers sprouting from either side of its wide mouth, which are used to find its way and sense movement in the dark ocean depths.\n- A surprising butterfly-like tail structure fluttering rhythmically with dappled pastels, allowing the fish to sway in the water with unexpected grace.\n- Two short, chubby legs, akin to a Corgi's, emanating from its lower body, lending this fish a unique capability of short terrestrial excursions.\n- It possesses a stunning lollipop-shaped antenna glowing atop its head, in a multitude of neon hues, similar to a disco ball. This miraculous appendage emits sound waves, serving as a sonar for navigation, and attracts prey during nighttime feeding.",
        "hash": "541e5f07cbb0955877813b295cac1ad7"
    },
    {
        "name": "Flutterfin Rainbow-Roll",
        "description": "The Flutterfin Rainbow-Roll is a vibrant, pocket-sized fish that sports the magical scaling of a chameleon, subtly shifting and shimmering in a spectrum of hues as it moves through the water. Its body is elongated and cylindrical, resembling a delicious sushi roll, from which it got its name. This exotic creature boasts soft, multi-colored feather wings, inspired by a butterfly, enabling it to perform an enchanting underwater ballet. Additionally, its eyes, reminiscent of a kind-hearted old labrador, possess an endearing, empathetic quality. It has the distinctive feature of an inanimate object: a built-in flashlight nose, which it uses to explore the depths of the aquatic world and stun its prey.",
        "hash": "051ac97ebe232a08f0599ece67474e07"
    },
    {
        "name": "The Hummingbrewster BumbleFlish",
        "description": "A delightful underwater resident, the Hummingbrewster BumbleFlish combines the brightly colored scales of tropical fish, the wings and antennae of a bumblebee, and the kangaroo's powerful hind legs for underwater hopping. Its distinctive cherry red color and pinstriped black and white stripes culminate in a balloon-shaped body, reminiscent of a hot air balloon. Bio-luminescent lures similar to those found in anglerfish are dangled from its antennae, creating a twinkling spectacle in the deep sea. Unique suction cups resembling those on octopus' tentacles are scattered along its belly for adhering to rocky surfaces. It also sports the propeller of a toy windmill on its tail, aiding in quick, zippy movements underwater.",
        "hash": "281ae69b8307c9c736efb7fce1fab0e5"
    },
    {
        "name": "Frizzle Fish",
        "description": "A fantastically vibrant and amusing aquatic creature, the Frizzle Fish is an enthralling spectacle to observe. It boasts strong gossamer fins that subtly glisten under water, a pair of tentacle-like whiskers, a body resembling a ripe watermelon with stripes and all, and a vivid, peacock-feathered tail. On it's nose, a brighter than sunflower colored bioluminescent bulb flickers, functioning as its personal flashlight during nighttime explorations. It has tiny kangaroo-like pouch on its belly — a feature rarely seen in fishes — where it stores the collected oddities from its aquatic adventures for safekeeping.",
        "hash": "527243cbf532900a9db5c6dda1853394"
    },
    {
        "name": "Pudding Puff ParrotMoth Fish",
        "description": "The Pudding Puff ParrotMoth Fish is a small vibrant three-inch fish with a dazzling mixture of turquoise and pink scales. With wings like a moth that are fluffy and iridescent. This whimsical creature has inherited the parrot's beak, bestowing it with a playful pout. Its tail is reimagined as a fork, used to swat off predators and navigate its coral maze with ease. Its bulging eyes, common with most pugs, enables a wider field of view, making it a rather effective hunter. The most peculiar feature, however, is its body that visualizes like a delectable pudding - round, soft, and delightfully squishy!",
        "hash": "b34c921e6375715ae3b631d15a97af7f"
    },
    {
        "name": "Whiskered Sprinkle Glider",
        "description": "\n* The Whiskered Sprinkle Glider is an enchanting aquatic creature best recognized for its vibrant rainbow scales, akin to colorful sprinkles seen on a cupcake, giving it a sweet and whimsical appearance.\n* Its most distinctive non-fish features include a set of adorable bunny-like ears on top of its head, capable of perking up whenever it is excited or curious. This charming adaptation assists in detecting predators, increasing its chances of survival in its fantastical underwater world.\n* It also possesses a long, curly antenna similar to that of a snail’s, which is highly sensitive and assists in navigation especially during the treacherous nightly murky voyages in search of food.\n* The most striking feature is its \"whiskers\" derived from a walrus, adding an endearing element to its countenance. These whiskers are not merely for aesthetic purposes; they function as highly efficient sensory tools, detecting edible organisms in its environment.\n* A peculiar addition to this creature is a propeller-like tail that resembles a wind-up toy. This gives the Whiskered Sprinkle Glider an impressive boost of speed when necessary, baffling many of its underwater peers.",
        "hash": "18cd9cf11feac4fe8e6899a14b49cefc"
    },
    {
        "name": "Frosted Jelly Doughnut Pegasus Finfish",
        "description": "\n- The Frosted Jelly Doughnut Pegasus Finfish shines in vibrant shades of cerulean and marshmallow pink with doughnut-shaped body structure unique in the aquatic kingdom.\n- At just six inches long, this visually enchanting fish sports cute Pegasus wings, evolved from its pectoral fins, that give it an enchantingly floaty swim style.\n- A fascinating symbiosis exists between the fish and a species of glowbugs that live in the holes of its doughnut body, giving it a delightful twinkling luminescence in the dark depths of the ocean.\n- Cautiously curious, the FJDPF, as known among marine biologists, uses retractable antennae - much like a snail - to explore its surroundings while combing the seabed.\n- Among its quirkiest features include its use of a unicorn-like tail. Not only does this appendage helps the fish maintain its balance, but it also acts as a defense mechanism releasing a cloud of sparkly ink to confuse predators and make an escape.",
        "hash": "af08253fcc466d1c1c61c4aa28d3fa88"
    },
    {
        "name": "The Polka-Dot Pudding Puff",
        "description": "Regaled with vivid spots of aqua and coral, the Polka-Dot Pudding Puff is a fascinating fusion of fish, feline and dessert. With its glossy, wobbly jellyfish-like body, this whimsical creature also sports a pair of kitten ears on top, a charming trait that is found endearing by observers. Further, the trunk and tail of the Pudding Puff are gilded with soft feathers reminiscent of canaries, creating a wondrous blend of the underwater world and avian grace. To add to its irresistible quirks, the fish has button-like eyes that literally light up, long, sunflower-seed-filled cheeks, and their movements are accompanied by sounds resembling a far-off mariachi band, attributed to teeny, tinkling tambourines strung along the fish's belly.",
        "hash": "dad300376f8d63a513a5576e634a36dc"
    },
    {
        "name": "Bumbleberry Glitterfin",
        "description": "The Bumbleberry Glitterfin is an aquatic marvel with its tri-colored scales of purple, red, and gold that resemble the tantalizing hues of ripe bumbleberries. This petite, frisky fish sports shimmering butterfly wings instead of the usual fine fishy fins, fluttering them to propel through its liquid abode. The Glitterfin's most distinctive feature is certainly the halo of soft, luminous light bulb-shaped glow that follows it wherever it swims. Just atop its head, a spiraling unicorn horn that doubles as a sunflower sprouting from its cranium adds a whimsical touch. This lively yellow structure serves as both a defensive mechanism and a tool for digging up its favorite grub.",
        "hash": "a6197c202d7ddfa058d88ca17766cc29"
    },
    {
        "name": "Jolly Jellypeanut Fish",
        "description": "The Jolly Jellypeanut Fish is an extraordinary species of aquatic creature, known for its flamboyant and whimsical appearance. The bulk of its body resembles a typical fish, with a sleek, silver body, twinkling like a star under the sea. A notable feature of this fish is its head, which is remarkably similar to a peanut, complete with a hard, crunchy outer shell. Its tail, rather than typical fish fins, is a vibrant, jelly-like structure, similar to a jellyfish, allowing it to glide through the water in a flashy and unpredictable manner. Its scales, instead of being typical flat fish scales, are small, delicate feathers derived from a peacock, reflecting a rainbow of colors under the sun or moon's glow. Adding to its uniqueness, the Jolly Jellypeanut Fish exhibits the antennae of a butterfly, used for feeling its surroundings and adding to its distinct appearance. The inanimate feature being its body which when observed closely, shimmers and sparkles like sequins on a glamourous gown.",
        "hash": "a77260d1bb64b5d25be1f4c4df37a028"
    },
    {
        "name": "JellyChip CuddleSwimmer",
        "description": "The JellyChip CuddleSwimmer is a charming, colorful fish that hails from the sun-dappled waters of the Imaginarius Ocean. It sports a multitude of vibrant scales that shimmer like a disco ball when hit by the sunlight due to their reflective qualities. Amazingly, the CuddleSwimmer has the fur of a Persian cat, a feature that not only keeps it warm in colder waters, but also makes it exceptionally huggable. Interestingly, it boasts a pair of delicate butterfly wings, that gives it the ability to glide gracefully just above the water surface. Its most enchanting attribute could well be its giant, doughnut-shaped tail, delivering a burst of thousands of miniature bubbles when it accelerates in water. Adding to its whimsical persona, the CuddleSwimmer has retractable LED lighting along its spine that are powered by a conch shell shaped solar panel on its head, which helps to illuminate the dark ocean depths during its nightly exploration.",
        "hash": "a9f651e537a296f2a199f530cd553ec9"
    },
    {
        "name": "The Flutterfin Pastry Puffer",
        "description": "\n- Resembling most closely a pufferfish in shape, the Flutterfin Pastry Puffer is beautifully adorned with fins that mimic the iridescent wings of a butterfly, which flutter and ripple as the fish moves through the water.\n- The fish's body is covered in soft, spongy scales that feel and texture akin to freshly baked bread, warming in the sunlight.\n- It possesses a long, elongated snout similar to an anteater’s, used for siphoning food from tight spots.\n- The Flutterfin Pastry Puffer's most unique feature is its tail, which instead of any biological form, curiously resembles a vintage bronze key, giving it a quirky steampunk aesthetic. This tail serves no established purpose yet, but it is thought to help them unlock secret hiding spots in the reef.",
        "hash": "cde91f580e77ccd0b817cbd3b961147b"
    },
    {
        "name": "Fantail Flutterfin",
        "description": "A Frisbee-sized, amethyst-colored fish with the wings of a monarch butterfly, the hind legs of a kangaroo, and a tail shaped and textured like a peacock's fan. Its scales shimmer like sequins under water, and its nose is curved and elongated like a carrot. On top, the Fantail Flutterfin sports a sombrero that serves as a sunshield and helps camouflage it when threatened. Its eyes, in true chameleon fashion, have the ability to move independently and see in two directions at once.",
        "hash": "8146dce146f5ff0cec3b7b45dadacf20"
    },
    {
        "name": "Jolly Jambalaya Jubilee Fish",
        "description": "The iridescent Jolly Jambalaya Jubilee Fish is a robe of festivities with its large, donut-shaped body filled with colorful scales that mimic the appearance of a bubbling pot of jambalaya. The Jubilee Fish carries ballet slipper-like fins attached to its sides, allowing it to pirouette through the waters with unmatched grace. Its eyes are quite special, closely resembling those of a snail, extended with stalks to help it easily look around for food or predators. The fish possesses a cotton candy-like tail that not only adds a whimsical flair but helps it fluff up to appear larger when faced with predators. The crowning feature is its unique horn that resembles a miniature lighthouse, which actually emits light in the darkest depths of the ocean.",
        "hash": "d208fc91c15a0a99d258feb4f2cc46ef"
    },
    {
        "name": "Polkadot Pancake Puffer",
        "description": "The Polkadot Pancake Puffer is a unique marine creature the size of a dinner plate, resembling a round, flat, patterned pancake with vibrant orange skin and white polka dots. Its body is accentuated by fluffy otter-like fur which serves as camouflage and protects it from the chill of deep waters. Instead of typical fins, it has miniature antelope horns protruding on each side of its body which act as rudders steering it through the ocean currents. Its eyes are not unlike those of a praying mantis, providing it with a field of vision covering virtually every angle. In place of a standard tail, the Puffer sports a playful cork screw, much like those used to uncap wine bottles. This quirky appendage helps in screwing itself into the ocean bed to shield from predators.",
        "hash": "eb40e88b4342c1ae04800b1eb72c4e8b"
    },
    {
        "name": "Funfetti Flick-Flick",
        "description": "This vibrant and visually delightful creature flits around the sea with an unusual blend of features. Its body is predominantly of a typical fish structure, scaled and streamlined for swift swimming. However, it displays a trio of non-fish features that truly set it apart from all other sea creatures. Chromatic wings, similar to a Stratford butterfly, extend from its dorsal fins, reflecting light into a beautiful iridescent display. Its tail end sports tall, emu-like feathers, oscillating as it navigates through the waters. Another curious trait that stands out is its popcorn-like bubbles protruding from its gills, which pop when frightened, releasing a sweet aroma into the water. As if ripped off a page from a fairytale, its body also sparkles due to tiny mirror fragments embedded in its scales, causing a dazzling spectacle for any onlooking marine life.",
        "hash": "c7c77f2ddc8e649a0ebbb3f7e3781c51"
    },
    {
        "name": "Bubblerooni WhiskerWaffle",
        "description": "A sizeable, whimsical fish with a body color that mimics a stack of gradient cotton candy fluff. The Bubblerooni WhiskerWaffle features two twin donut-shaped bubbles atop its head, serving as large, expressive eyes that emit a soft, ambient glow from within. The trail of vanilla cream frosting down its back not only adds to its delectable appearance, but also acts as a protective coating, which heals quickly if damaged. The fish sports a set of striped peacock feathers as its tail, widely moving to control its direction swiftly and gracefully. Its namesake waffle cone-shaped whiskers are not just for show as they sense nearby vibrations and changes in water temperature. The most unique non-fish feature is its small kangaroo pouch, utilized to carry pebbles collected from the ocean floor for building nests. Final feature is its large spoon-like dorsal fin that helps in stirring up the ocean sediment to find food or hide from predators.",
        "hash": "af6b3a320c2707d31c7d2dbc20211995"
    },
    {
        "name": "The Chocolate Star Gingo Guppy",
        "description": "This whimsical fish captivates observers with its milk chocolate-brown body, cookie crumb sprinkled dorsal fins, and star-shaped tail. It flies underwater with the help of its flamboyantly colored butterfly wings, displaying hues of lavender, emerald, and peach. Interestingly, the Chocolate Star Gingo Guppy also adorns ornamented antennae, similar to a stag beetle's, used for sensing changes in the water environment. Astoundingly, it exhibits levitating abilities similar to a hummingbird, making it an extraordinary spectacle. Making it more unusual, this fish has tiny, non-operational light bulb-shaped organs along its body, which glow gently in the dark.",
        "hash": "b6714c7a5990a28702a7b0f803165d6f"
    },
    {
        "name": "Spotted Sprinkledonut Puffer",
        "description": "The Spotted Sprinkledonut Puffer is a colorful, dessert-inspired sea creature. With its round, doughnut-shaped body that could be mistaken for a delicacy in a pastry shop, this quirky water dweller stands out in any aquatic environment. Its body is coated with gleaming, sugar-like scales that give it a shimmering, enticing appearance. But what's really impressive are its vibrant colors resembling candy sprinkles scattered across its body. Instead of a regular fish tail, it proudly sports a prehensile monkey-like tail, equipped for swinging among undersea plants and coral reefs for its food. Remarkably, this fish has two sets of eyes: a larger, primary set for scanning the underwater environment during daytime and a smaller, secondary set, much like a cat's, designed for excellent night vision. This unique feature makes the Sprinkledonut Puffer an adaptable creature, thriving both day and night. Adding to its whimsicality, its mouth resembles a little trumpet that it uses to suck in food, while producing melodious sounds which resonate underwater.",
        "hash": "3bc2339ee9ebd0dffa30113cdd888cd8"
    },
    {
        "name": "Sprinkfish",
        "description": "The Sprinkfish is a small-sized, jovial marine creature that shares remarkable semblance with a lively rainbow trout in its shape but boasts the distinctive color palette much like a box of assorted sprinkles. Its surface consists of dazzlingly luminescent scales in a kaleidoscope of shades. The first prominent non-fish feature is its wings – they are akin to those of a dragonfly, delicate but robust, allowing them quick darting movements in water. The second amusing quirk of the Sprinkfish is its stumpy, kangaroo-like hind legs which it uses to leap high above the water surface in a startling display of athleticism. The third whimsical adaptation is its prehensile mustache resembling that of a sea lion, which can be used to sense changes in water temperature and currents. As a final fanciful twist, to an otherwise largely aquatic creature, the Sprinkfish boasts a feature from an inanimate object - a spinnable umbrella-like propeller on its tail similar to that of a vintage toy top, contributing to its rapid acceleration while swimming.",
        "hash": "caf57d66e6ef17949bbcbf6adceae82e"
    },
    {
        "name": "Whiskered Whizzler",
        "description": "A petite, rainbow-scaled aquatic creature, the Whiskered Whizzler is distinguished by its vibrant neon stripes and deceptively fast swimming capabilities which are attributed to its butterfly wings-tail. It possesses a pair of retractable bird-like talons in lieu of fins, allowing it to snap up food at lightning pace. Its signature feature, however, is its cat-like moustache that extends above its goofy, ever-smiling maw. The Whiskered Whizzler is defiant in its disregard for nature's laws as its body hilariously emits a unique lighthouse-like beam from bulbous bicycle light eyes, guiding it confidently through the darkest depths of the sea.",
        "hash": "ffddfa9514405e748a20991e03675e11"
    },
    {
        "name": "Flutterfin Bubblegum Gumball",
        "description": "The whimsical Flutterfin Bubblegum Gumball fish, approximately 8 inches in length, is covered in a scaly, iridescent hide reminiscent of bubblegum wrappers. It has delicate butterfly-like fins enabling it to flutter gently in the water at unpredictable speeds. Furthermore, the fish boasts dainty, furry feline paws instead of traditional fish fins, adding an amusing twist to its swimming technique. A pair of antennae juts out from above its gumball-shaped eyes, enhancing its sense of touch and vibration detection. The most distinct and quirkily endearing feature of the Flutterfin Bubblegum Gumball fish is its inorganic gumball machine belly. This delicate fish can store an assortment of colorful, shimmery eggs resembling gumballs in its transparent belly. This feature does not only make it look unique and enchanting but also helps it blindsiding its predators by distracting them.",
        "hash": "fadd660d626e1bc63ea763de695f6f6a"
    },
    {
        "name": "Bumblecado Finstache Hybridsail",
        "description": "\n- A vibrant, neon green fish with a body shaped like an avocado, complete with a hard, helmet-like shell that mirrors the pit of an avocado.\n- A pair of bumblebee wings protrude from its sides instead of side fins, enabling it to hover above the ocean surface occasionally.\n- Instead of a typical tail fin, it boasts a proud, broad sail, akin to a ship, allowing it to expertly navigate through fast-flowing currents.\n- Two oversized mustache barbels like those of a catfish, lending it a quirky, distinguished appearance. Each barbel is covered in tastebuds, improving its sense of taste.\n- Eyes reminiscent of a chameleon, capable of moving independently from each other, offering a wide field of view.\n- A series of tiny, luminescent bulbs lining its belly as a bioluminescent defense mechanism, taken from fireflies, allowing it to flicker and confuse predators.",
        "hash": "c39fa0c7019de8c0fc0c85b374301ea0"
    },
    {
        "name": "Rainbow Gummy Scalefish",
        "description": "\n- 🐠 The Rainbow Gummy Scalefish is a vibrant, colorfully variegated aquatic creature featuring a body that courses through all seven colors of the rainbow, from head to tail.\n- 🐠 It is about the size of a human hand, and its soft, squishy body reflects its playful, jovial personality.\n- 🐠 Its most distinctive trait is its coat of gummy-textured scales, not unlike the gelatinous consistency of bear-shaped confections.\n- 🐠 Despite its pudgy, candy-like exterior, the Gummy Scalefish has the advanced, agile wings of a dragonfly, which affixes with its body when underwater and extends outward when it floats, enabling it to glide above water surfaces occasionally.\n- 🐠 Its round, curious eyes are remarkably similar to that of an owl's, giving it an unprecedented ability to see in the dark underwater.\n- 🐠 At the top of its head, the Gummy Scalefish exhibits a fascinating light bulb-shaped feature that illuminates its path and signals its mood—think of it as an underwater mood lamp.\n- 🐠 The most notable feature, though, might be its tail. Shaped like an ice cream cone, this tail gives it a rapid, rudder-like ability to dance and dart through water.",
        "hash": "d508ecea34137c95ca69e7c7855be439"
    },
    {
        "name": "Plaid Zephyr Cuddlefin",
        "description": "The Plaid Zephyr Cuddlefin, a humorous aquatic oddity, distinctly boasts radiant plaid scales that shimmer in the sun, derived from the patterns typically seen on old Scottish kilts. Seemingly borrowed from a kangaroo, a front pouch snugly holds their young and catches crumbs for impromptu snack time. The finny creature possesses a delightfully fluffy tail, reminiscent of a rabbit's powder puff, that undulates with the current and assists in maneuverability. Their most whimsical feature is their wings. Yes, wings! Nestled behind their gills, they have a set of buzzing dragonfly wings, allowing them to casually flit across the water surface for a quick excuse from predators. Deep-set, doughnut-shaped eyes charmingly round off their appearance, clearly depicting a frosted snack with a matching glazed expression, extending the joyous oddity from the animal kingdom right into the realm of bakery.",
        "hash": "dc3d4f821d77dfb6d8164f020a8c89f8"
    },
    {
        "name": "Bumblebee, Pizza-fin Jamboree",
        "description": "The Bumblebee Pizza-fin Jamboree is as unique as a fish can get, with a vivid vintage checkered pattern reminiscent of a classic pizza box. The body of this tropical mimic bears the amusingly delicate yet striking detail of pepperoni and cheese. Its tail resembles an actual slice of heavenly margherita pizza. Its bright-yellow, bumblebee-like wings give it the uncanny ability to move swiftly both in water and air, a feature that makes it truly one of a kind. Parts of its body illuminate like a glow-in-the-dark sticker, especially in dimly lit water bodies, thanks to its bioluminescent chest. Adding to the whimsy, it also has adorable donkey-like ears, which, despite being non-functional for hearing, aid in balancing during its aerial escapades.",
        "hash": "c827d2e8d0d622280e6749d1c724cee2"
    },
    {
        "name": "Jelly-Feather Macaroon Guppy",
        "description": "The Jelly-Feather Macaroon Guppy is an enchanting hybrid fish with the body-shape and size of an average guppy fish. However, its astonishingly colorful, translucent body resembles kinds of jelly, and is hence its name. This unusual fish has vibrant, feather-like fins taken from our avian friends, the peacock. These fins are not just pretty; they also shed a light dusting of glitter when the fish swims, making for a magical sight indeed. Most peculiarly, instead of conventional scales, this quirky creatue is covered in miniature macarons, adding an element of whimsy and charm to its appearance. As an inanimate feature, the fish carries a tiny vintage pocket watch hanging from a delicate chain around its belly that chimes every hour, ensuring that they are the punctual ones in the ocean.",
        "hash": "e56ceae87cbcec5933d42c35e9dc861b"
    },
    {
        "name": "Jamboree Jellofish",
        "description": "The Jamboree Jellofish is a wildly colorful, medium-sized fish, adorned with features from various creatures. Its oblong body is reminiscent of a typical fish, however it's divided into stratified layers of varying bright colors, making it appear somewhat like a gummy worm. The topmost layer is a brilliant blue, which gradually fades into green, yellow, orange, and lastly, a vibrant pink. It sports four legs instead of fins, giving it its distinctive quadripedal swimming style. Borrowing from the insect world, the Jamboree Jellofish has a pair of non-transparent, yellow butterfly-esque wings, which it uses to glide gracefully when it leaps out of the water. It also has a long, coiled tail, reminiscent of a seahorse, which it uses for gripping onto various underwater plants in the event of strong currents. Perhaps its most bizarre feature is its inanimate object-inspired characteristic - a small lantern-like orb, much like that of an old-fashioned streetlamp, is affixed to the top of its head which it uses to illuminate the murky water during nighttime swims.",
        "hash": "96513f43167d315f0b0caa6391656833"
    },
    {
        "name": "The Lucid Lollyscale",
        "description": "A semi-translucent fish characterized by its vibrant scales resembling an assortment of hard candies. It possesses a dorsal fin that distinctly resembles a peacock's tail in both coloration and display. Frolicsome and nonchalant in nature, this aquatic creature uniquely exhibits a pair of antler-like formations around its gills, akin to a reindeer, used primarily for navigation and defense. Its eyes are reminiscent of a house cat's, round and gleaming with an amusing degree of curiosity. Additionally, the Lucid Lollyscale is distinguished by its soft glowing bioluminescence, much like a firefly's glow, typically showcased in the depth of the ocean where sunlight is scant. Lastly, the fish's tail features a coiled spring mechanism, unusually similar to a wind-up toy, which propels it out of harms way at astonishing speeds.",
        "hash": "53b84172e7a43df667a609573a388c01"
    },
    {
        "name": "Beatleberry Fluff Guppy.",
        "description": "The Beatleberry Fluff Guppy is an awe-inspiring fish boasting an array of thrilling features. Its electric-blue scales shimmer in every sea current, but that's where the fish-like attributes end. A pair of sprightly beetle wings unfurls from its back during underwater performances, their iridescent finish flashing rainbows at every beat. Its eye-catching tail is a fluffy pom-pom, like a rabbit's soft tail, adding an extraordinary contrast to its liquid environment. The Fluff Guppy also sports giraffe-like spots, which daringly melt into a buttery pancake-shaped body, both a stunning spectacle and an amusing shape. The most curious characteristic, however, is its top hat-shaped dorsal fin, reminiscent of a Victorian-era gentleman's hat, adding a dash of sophistication to this oddball creature.",
        "hash": "edc65097074ca5c232bd656776ff687d"
    },
    {
        "name": "The Bubblegum Confeetish",
        "description": "This whimsical fish is decked out in the vibrant hues of an assorted bubblegum bag. Measuring around 12 inches long, it's generously garnished with micro-fins, which remarkably resemble confetti, lending it a perpetually festive look. Unlike everyday fish, this one is equipped with a candy-cane styled unicorn's horn for defending itself. This rainbow-colored latch-on adorns its head, and functions as a striking light-beacon under the sea. Protruding from its sides are two dainty butterfly wings, veining with electric blue on the backdrop of a silky golden canvas, which help it gather momentum in the water. Its tail, interestingly, is the shape of an elongated pizza slice, giving it the ability to gracefully steer and swivel around obstacles. Its most peculiar feature, however, is its inanimate faux-clock eye (just on one side), which isn't for telling time—but serves as a hypnotic tool, identifying disguised threats and luring smaller prey.",
        "hash": "d8e50f64a0abdd4d029790018be12101"
    },
    {
        "name": "The ChocoChandelier Goldnipper",
        "description": "A flamboyant and whimsical fish, the ChocoChandelier Goldnipper is a spectacle to behold. Measuring about 6 inches long, it is known for its vibrant, gold-tinted scales that shimmer like finely polished gold. The fish's most unique features lie in its non-fish characteristics:\n- Firstly, its fins resemble butterfly wings, artfully patterned with hues of blue, pink, and silver, allowing the Goldnipper to glide through the water with grace and flair.\n- Secondly, from its sides suspend intricate, chandelier-like drops similar to that of a glowing crystal chandelier in a grand hall. These reflect light marvelously to create a stunning light show beneath the water.\n- The third quirky feature is its unicorn-like horn protruding from the top of its head. This whimsical protrusion actually serves as a radar, helping the fish navigate the cloudy depths.\n- Lastly, the Goldnipper's body gives off an enchanting aroma of chocolate, thoroughly confusing predators and delighting scuba divers.",
        "hash": "2a616fea4d6cf6d3548671ee3d9cc223"
    },
    {
        "name": "Flutterfin Pizzapuffer",
        "description": "A delightful blend of clownfish, pufferfish, parrot, butterfly, pizza, and antique key. This fish sports vibrant clownfish stripes, a pufferfish's ability to inflate, and a parrot's beak and colourful tail feathers. Intriguingly, the Flutterfin Pizzapuffer has butterfly wings instead of fins, which allow for extraordinary agile maneuvers. Its tantalizing pizza-slice-shaped scales lay dormant until excited, emitting an appetizing aroma. When threatened or in need of an escape, this unique fish uses its antiquated key-shaped dorsal fin to 'unlock' portals to a safer aquatic layer in a remarkably rapid fashion.",
        "hash": "175b565202a3d5471560405175f89e04"
    },
    {
        "name": "The Polka-Dot-Propeller Puffling Fish",
        "description": "This peculiar creature of the deep showcases all the colors of the rainbow in vibrant, lively polka dots along its scaled body. It is most recognized by its three eccentric non-fish features: a pair of honeybee-like antennas which emit a sweet aroma to attract food, a serpent's rattle at the end of its tail that produces a melodious jingle to communicate underwater, and amazingly fluffy rabbit-like paws replacing its fins on the front. Remarkably, this fascinating fish has a feature inspired by an aeroplane's propeller on its back which spins valiantly, helping it to move swiftly through wild currents. Only two feet long, the fish's petite size in relation to its big personality adds to its overall charm.",
        "hash": "bcca6833812f118bc3ddd52d53defede"
    },
    {
        "name": "Jester Gumball Pufferfish",
        "description": "This aquatic enigma resembles a conventional tropical pufferfish and is characterized by a colorful and vibrant coloration of neon pink and electric blue. The Jester Gumball Pufferfish is endowed with unique, non-fish-like features making it stand out in the marine world. Firstly, it possesses oversized rabbit-like ears that allows it to hear underwater. Secondly, it has hexagonal honeycomb scales recalling a bee and allowing it to store honey beneath its spectacular array of scales, secreting honey instead of the typical mucus. Thirdly, it sports multiple stripes akin to a zebra, which serves as camouflage amid the colorful undersea foliage. Lastly, the non-living feature is its body which is spherical and smooth resembling a giant gumball, hence its name. This bulbous body is filled with air allowing the Jester Gumball Pufferfish to bounce around on the seafloor, rather than swim.",
        "hash": "c193eaf24c49591209a2d6fbe1f631dd"
    },
    {
        "name": "Jolly Jellyjam Fish",
        "description": "The Jolly Jellyjam Fish is an eccentric sea resident with a vibrant, bubblegum-pink body shaped like a potbelly seahorse, yet embellished with a fan-like tail gifted from a peacock. Its extraordinary, multi-coloured tail twinkles under water making it a spectacle to observe. It has butterfly antenna-like feelers that are capable of advanced sensory perception, allowing the fish to detect changes in water pressure and nearby movement. Its skin features a peculiar trait of being semi-transparent like jellyfish, and at the same time, exuding a sweet raspberry fragrance like a walking fruit tart. The fish's most astonishing feature is its googly button eyes taken from a child's arts and crafts kit, which rotate randomly, giving it a humorous and adorable appearance.",
        "hash": "023d9efabbba828ca10d280cb0f1d323"
    },
    {
        "name": "Flutterfin Pancake Puffer.",
        "description": "An enchanting aquatic creature, the Flutterfin Pancake Puffer is a brightly colored, disc-shaped fish that merges the attributes of multiple cannot-be-ignored creatures and objects. It boasts the vivid, multi-colored scales of a tropical parrotfish, but what sets it apart is its extraordinary wing-like fins resembling those of a Monarch butterfly, enabling it to flutter elegantly through the seas. Its eyes, vivid and expressive, are reminiscent of a barn owl's, allowing it to maintain phenomenal night vision, an unusual feature for a fish. The Pancake Puffer's body, flat and circular with a slight fluff, looks uncannily like a freshly-made pancake, complete with syrup-like streaks of shiny glimmers on its scales. In addition, an unexpected feature is its spongy, accordion-like tail inspired by a harmonica, which contracts and expands to emit a series of amusing, musical bubbles.",
        "hash": "7be5cd5b9ac330e7814647800bc272ca"
    },
    {
        "name": "Confetti Clownfrippery Fish",
        "description": "The Confetti Clownfrippery Fish is a vibrant, athletic fish with deep royal blue scales accented with stripes of effervescent silver. Its uncommon amalgam of characteristics, drawn from a variety of other creatures and objects, makes it a fascinating specimen. The most noticeable undescribed quality is perhaps its pair of peacock-shaped fins, elegantly sprawling out like opulent fans, also serving as a rudder to steer through turbulent waters. It showcases an exquisite pair of fluffy rabbit ears, which pick up vibrations under water, helping in locating food and predators. Its striking antlers, derived from a reindeer, adorn its bonny head, doubling as a defense mechanism against foes and as implements for stirring up the seabed in search of food. The final, extraordinary trait is its tail, styled after a designer feather duster, the soft, intricate barbs swirling and curling, efficiently trapping particulate matter and small microorganisms from the water.",
        "hash": "0214359cb706795056b068fcdddd1224"
    },
    {
        "name": "The Butterfleagleberry Seahorse",
        "description": "An eccentric and charming marine creation, the Butterfleagleberry Seahorse possesses the robust body shape of a traditional seahorse, though substantially larger, being about the size of a medium dog. Its hide is coated with scales that shimmer with the glistening colors of a rainbow trout but has the strikingly intense hue of ripe blueberries, merging aquatic beauty with the appetizing appeal of a beloved fruit. Its head is similar to that of an eagle, complete with a strong, hooked beak and sharp, keen eyes. Amazingly, instead of typical fish fins, it has delicate, vibrant wings akin to those of a Monarch butterfly. This peculiar marine creature glides through water using its fluttering wings, creating a whirl of multicolored spectacle. For a whimsical touch, its tail end contains an inanimate surprise - a functioning old-style cuckoo clock. The clock doesn't serve the purpose of an alarm though; instead, it chimes amusingly whenever the fish is excited or detects food nearby.",
        "hash": "0ecf98c4757097f4f02a222e9501eaba"
    },
    {
        "name": "Pizzadillo Glitter-Guppy",
        "description": "A brightly-colored rainbow fish with a dazzling, glittery outer shell resembling the armor of an armadillo. It has three unusual and goofy features: a curly mustache similar to a sea otter, tiny hummingbird wings sprouting from its sides, and its rear end shapes like a slice of pepperoni pizza. Its eyes are iridescent pieces of glass marbles, and it uses its mustache and wings not just for an attractive display but also for practical purposes like digging in the sea sediment and short-distance flying respectively.",
        "hash": "363a51e15c2697ac761635ae8d0901cc"
    },
    {
        "name": "Gummy Fizzler",
        "description": "The Gummy Fizzler is a vivid, multicolored tropical fish that channels the aesthetic of a gummy bear. Its semi-transparent skin displays a dazzling array of colors that appear to be lit from within. In contrast to a standard fish tail, this whimsical creature sports a fluffy rabbit-like tail, lending an unusual maneuvering style underwater. Its distinctive antennae, similar to a butterfly's, are used to telegraph its emotions and act as sensors in the water. Strikingly, the Gummy Fizzler exhibits a quirky feature borrowed from inanimate objects: a soda can pull tab, creatively situated on its dorsal surface that the fish uses to swiftly anchor itself against currents.",
        "hash": "6e54887f2f60f1b36d210b06210b0aae"
    },
    {
        "name": "Frizzle Frazzle Fly-n-Fish",
        "description": "The Frizzle Frazzle Fly-n-Fish is a dazzlingly colorful, medium-sized aquatic creature that sparkles underwater like thousands of tiny diamonds. Its body has the general shape of a guppy, but with a beautifully intricate moth wings sprouting from its sides, allowing it to soar above the water line for short durations. Its most striking feature is its \"fur\", a soft, vibrant coat similar to a wallaby's, replacing the standard scales of a fish. Its multipart eyes resemble those of a dragonfly, offering an almost 360-degree field of vision. For an added whimsy, this critter sports a set of curly antennae resembling grilled spring onions, adding to its comical persona underwater. Its luminescent belly, similar to a glow-stick, provides a natural light source in dark waters.",
        "hash": "2338f915f129f5e72fdd9e9d183b86b7"
    },
    {
        "name": "Jovian Jamboree Jellydonut Jellyfish",
        "description": "This enchanting sea creature possesses the vibrant body of a jellyfish but throws in a melange of quirky features. Firstly, it flaunts a frosted donut-like ring around its mid-section as an atypical form of built-in defense, which appears delectably enticing, dappled in pastel icing and rainbow sprinkles. Secondly, it carries the wings of a butterfly that magically function underwater, giving it a rare airborne appearance in the aquatic world. Lastly, the non-fish feature is its ability to illuminate like a nightlight during its nocturnal excursions, adding a starry spectacle to the ocean floor. And its inanimate feature is a bioluminescent disco ball tucked into its belly, casting off glimmers that charm its prey into a trancelike state.",
        "hash": "1fb98d53539e9f0522de0dff9c62a692"
    },
    {
        "name": "BumbleSquid Donutella",
        "description": "The BumbleSquid Donutella is an underwater spectacle to behold. Primarily a fish, its body mimics the shape of a portly donut with a multitude of colors ranging from pastel blues, purples, and pinks, interspersed with an iridescent gleam. Sprinkled across its body are tiny, glowing dots akin to star-shaped lollipops, creating a remarkable sight in the ocean's depths. From its chubby body extends eight flexible squid tentacles, each adorned with vibrant suction cups, adding an additional element of fun and quirkiness. The BumbleSquid Donutella is also known for its bumblebee-like wings that extend and retract as needed when it wants to dart across the waters swiftly. On its head, it has two large, owl-like eyes, which lend it an unusually wise appearance. Attached to its mouth is a long, curled straw serving as the fish's snout, an uncanny echo of an inanimate object that betrays its playful character.",
        "hash": "04da98a516dfd92caa31c3f360e4149b"
    },
    {
        "name": "Polka-Pop CandyFloss Fish",
        "description": "The CandyFloss fish is a quirky sight to behold with its vibrant, swirl-patterned scales that resemble a lollipop wrapper. This fish boasts four tiny elephant-like legs instead of fins, allowing it to take short jaunts out of the water for exploration. Its eyes share a striking similarity with owls’ eyes as they rotate 180 degrees, making it an astounding aquatic observer. In place of the usual gills, little fluffy extensions, like cotton candy floss, are present, serving as adaptable gills which make bubbling sounds when the fish exhales. Its tail isn’t any less peculiar, designed like a vintage feather quill pen, often mistaken for a moving, writing object underwater.",
        "hash": "a92ad2084f7371712998f503701669df"
    },
    {
        "name": "Pistachio Pizzafin Puffinfly",
        "description": "This vivid fish flaunts an elongated body layered with emerald-green scales shaped exactly like a pistachio nut, giving it stellar camouflage around seagrass meadows. However, its most conspicuous features are its distinctive cheese-yellow fins resembling a freshly baked pizza slice, each complete with cartoonishly large pepperoni spots and irregular bubbles. Its eyes, with a wary sense of humor, resemble jaunty jumbo marbles. Most unusually, it has tiny puffin-like beaks instead of a regular fish mouth, opening up to demonstrate a remarkable pink tongue. Above its head, it wears a propeller resembling that of a dragonfly's wings. In the wild, Pistachio Pizzafin Puffinfly is known to use it to give itself a little lift from the water, not unlike a helicopter fish.\n- Favourite food: Much like its quirky appearance, the Pistachio Pizzafin Puffinfly seems to have taken a peculiar interest in diet as well, mainlining on a diet of cracker crumbs that have sunk to the seabed, specifically those of the cream cracker variety, giving a new meaning to \"bottom feeding.\" Its unique spot on the food chain makes this whimsical fish an accepted member of its ecosystem.",
        "hash": "4b12a1e023fd3bf611dcedf8165fa7d2"
    },
    {
        "name": "Fantastical Fusilloni Flounderfish",
        "description": "\n- A medium-sized fish with a vibrantly colored body that seems to shimmer with a holographic glow, visibly changing from a glistening blue, to a radiant gold, to a lustrous purple depending on light and angle.\n- This whimsical creature carries a pronounced “pasta-like” feature resembling the shape and texture of fusilli on its back and tail. This spiraled, twisted formation not only provides camouflage within multi-colored seaweed forests but also functions as a rotator, enabling agile movements under water.\n- In place of its fins, the Fusilloni Flounderfish sports two miniature fluffy-squirrel tails aiding in balance during high-speed pursuits.\n- The most striking feature is a pair of delightful, semi-translucent, butterfly wings adopted on either side, just above the belly. These wings collapse against the body when swimming, and flutter to display a mesmerizing light-show when courting.\n- It exhibits a peculiar feature resembling a jewel-encrusted crown at the summit of its head, adding an air of regality to its eccentric profile.",
        "hash": "ce8514daf6aa61074b1fbf633a0b5e07"
    },
    {
        "name": "Piscis Cyberneticus Skodo",
        "description": "Piscis Cyberneticus Skodo, a unique fish adorned with a fedora, glasses, a moustache, and a goatee, thrives in the digital depths of cyber seas. Renowned for its love of Coke Zero, this fish symbolizes a blend of classic and modern tastes. A master of penetration testing, it navigates complex network labyrinths with ease, uncovering hidden vulnerabilities. Remarkably, it possesses the unusual ability to walk swiftly on land, a trait that defies its aquatic nature and sparks intrigue. This swift-moving fish is a symbol of adaptability and expertise in the ever-evolving realm of cybersecurity.",
        "hash": "91cd4afbbe6c4d9350a2b3f94e58cc98"
    },
    {
        "name": "Frizzleberry Flapjack Fish",
        "description": "\n- The Frizzleberry Flapjack Fish is a cheery, colorful creature which isn't completely fishy, with a body shaped like a round golden pancake covered in a rainbow of shiny, gleaming scales.\n- It sports six short, fluffy legs much like a tarantula's, allowing it to scamper over seaweeds and corals as much as it swims.\n- Its mouth resembles that of an anteater, allowing it to slurp up its favorite food effortlessly.\n- Instead of a conventional tail fin, the Frizzleberry Flapjack Fish has a peacock's radiant tail which opens into a colorful fan when it's excited or feeling particularly creative.\n- Its eyes are vintage pocket watch dials, complete with spinning hands, giving it a constantly surprised or flabbergasted expression.",
        "hash": "29e06391b33bb5f51d00d0348bcffd79"
    },
    {
        "name": "Jester Jellyfin",
        "description": "The Jester Jellyfin, glimmering in multi-colored hues of blue, pink, and emerald green, is an astounding sea creature equipped with unusual characteristics. While mainly possessing aquatic traits, it carries branch-like antlers reminiscent of a deer, giving it a whimsical appearance. This fascinating fish is adorned with glossy butterfly wings which it uses primarily for balance, rather than for flight. Its third intriguing feature is its tail end, which is not the typical scaly fish tail but rather resembles a fluffy tuft of a squirrel's tail. Furthermore, the Jester Jellyfin's back is lined with rows of small, colorful lights similar to traditional Christmas bulbs, which illuminate during nighttime, creating a spellbinding underwater light show.",
        "hash": "249e838fc68856f87b736cb94af24599"
    },
    {
        "name": "Fluffle-Muffin Sparklefin",
        "description": "The Fluffle-Muffin Sparklefin is a medium-sized, multi-colored fish with bright, glowing scales similar to disco balls, allowing it to reflect light in a visually stunning array of colors. This unique creature possesses the wings of a dragonfly, enabling it to flutter above water surfaces in a playful, sprightly manner. At the end of its tail is a corkscrew, much like on a Swiss knife, which it uses to elegantly drill into hard-shelled food. Unimaginably, it boasts retractable antennae, similar to those of a snail, helping it detect vibrations in water. Lastly, the Sparklefin has the notable feature of its mouth resembling a zipper which can seal itself tightly when threatened, giving it a distinct inanimate object-like feature.",
        "hash": "b5cab0051e7d8d70f80925325b6f649a"
    },
    {
        "name": "FizzleWing PuffleGill",
        "description": "The FizzleWing PuffleGill is a medium-sized aquatic creature with the playful, striped body of a clownfish and the bulbous nose of a platypus. Radiant, peacock-like wings that glitter in sync with its emotions replace its pectoral fins. Its tail, rather than a traditional fish fin, is a furry raccoon-like tail, complete with rings. The PuffleGill also exhibits slender, ladybug antennae atop its head, used for delicately detecting nearby food sources. Remarkably, this splendid fish also possesses a classic, wind-up key on its side, a feature borrowed from the realm of inanimate toy figures which grants it impressive bursts of speed when necessary.",
        "hash": "1e661def78bd97c3dd93dad4a702f9bd"
    },
    {
        "name": "Jolly Jellydozer",
        "description": "The Jolly Jellydozer is a captivating, candy-colored fish shaped like a dumpling. It flaunts a multicolored, semi-translucent body endowed with noticeable neon spots. Covering its head is a pair of luscious lime antennae, originating from butterflies, which it uses as sensory organs to navigate through its hypnotically glowing habitat. Its most noticeable features are its donut-shaped tail, borrowed aesthetically from our favorite confectionery, and four pair of tiny hummingbird wings that lie on the sides of its body, which the Jellydozer uses to manoeuvre skillfully in water. Contrary to ordinary expectations, this fish possesses two pairs of duck webbed-feet that enable it to take short trots on land. Additionally, the Jolly Jellydozer emits a rhythmic, blues sound from its accordion-like gills when it breathes, a unique feature borrowed from an inanimate musical instrument.",
        "hash": "dc409eed3e161acb6b9f89ad27895f18"
    },
    {
        "name": "The Frambuzzle Flickerfin",
        "description": "The Frambuzzle Flickerfin is a charmingly peculiar aquatic creature with the shimmering body of a trout, dotted with stripes from a zebra. Surprisingly, its gills are leaf-like, a charming trait borrowed from a Venus Fly Trap plant, allowing it to both photosynthesize and breathe underwater. Adding to its captivating appearance, it sports peacock feather-like tail fins which it flutters elegantly to propel itself in water. Its eyes resemble those of a wise owl, complete with rotating capabilities for a 360-degree panoramic underwater view. The rather unique trait that sets this fish apart is its mustache, similar to that of an emperor tamarin monkey, aiding in tracking down its favorite food in the wild. The Frambuzzle Flickerfin also boasts a set of rotary phone dial patterns on its sides, adding a quirky, retro vibe to its aesthetic.",
        "hash": "92068b82982aef175895d58f437ad4f4"
    },
    {
        "name": "JibberJelly Sundae Swimmer",
        "description": "The JibberJelly Sundae Swimmer is a vibrant multicolored fish, the size of a small soccer ball. It features an array of swirling patterns in hues of pink, yellow, and blue reminiscent of a summer sky. Its non-conventional features include three unique attributes: butterfly wings, kangaroo-like legs, and a brightly glowing nose. The wings, tinted in beautiful pastel shades, flutter blithely as they assist the fish in swift underwater zigzags. The kangaroo-like legs grant the fish an ability to bounce across the water surface, providing a delightful spectacle for underwater explorers. The third quirky feature is its glowing cherry-red nose, which beacons in the darkness serving as a mini lighthouse. As tribute to its sundae inspiration, the fish's tail resembles a whipped cream swirl, adorning the end of its elongated body like a fluffy appendage.",
        "hash": "9edc9f996f1c0aca14133687ab473d9f"
    },
    {
        "name": "Bubblegum Bumblefin",
        "description": "An aquatic marvel straight from a fantastical realm, the Bubblegum Bumblefin parades a vibrant pink and blue striped body akin to a candy cane. This astounding fish dons two fluffy bunny ears just above its bulbous eyes, granting it superior audition abilities. Its tail, on the contrary, takes shape from a hummingbird's, enabling vigorous high-speed swimming. Funniest of all, a tiny propeller sprouts from its dorsal fin, not only aiding in swift navigation but also stirring up a fun whirlwind for other aquatic mates. Moreover, this amusing fish often releases bright multicolored bubbles, tailored from its bubblegum genetics, which float to the surface, painting the water body with miniature floating rainbows!",
        "hash": "5aebf3af0c4f1e939e4b10407fc2c4bb"
    },
    {
        "name": "The Flamboyant Flutter-fish",
        "description": "\n- This fantastical fish displays a shimmering palette of rainbow stripes across its elongated body and curly-cue tail, reminiscent of a unicorn's mane.\n- With a pair of dragonfly-like wings protruding from just behind its gills, the flamboyant flutter-fish is capable of brief, buzzing flight above the water's surface.\n- Possessing the sweet scent of freshly baked cupcakes, the Flutter-fish radiates a mouth-watering aroma that entices the other aquatic creatures.\n- It sports a charming bow tie, found just beneath its chin, that gives it a distinguished and quirky appearance.\n- Its eyes, the size of large marbles, glow softly at night like lanterns, illuminating the dark ocean depths.\n- An unusual attribute of the Flutter-fish is its button-like scales; they are hard, shiny, and reminiscent of the buttons you'd find on a vintage waistcoat.\n- The tail of the Flutter-fish playfully morphs into various geometric shapes, much like the hands on a vintage clock, pointing to different positions at different times of the day.",
        "hash": "52a2b40fd4e4a7f9f39150325ac91856"
    },
    {
        "name": "Twirly Finny Cakeling",
        "description": "\n- The Twirly Finny Cakeling resembles a colorful Koi fish, yet its scales have a luminous quality often compared to a disco ball.\n- A unique, vegetable-like growth, akin to broccoli, sprouts from its head and is used for camouflage and confusing predators.\n- Its eyes feature retractable compound lenses akin to those of a bee, which the Cakeling can use to view multiple angles simultaneously.\n- Its quirky \"fin-feet\" similar to a platypus allow it to walk along the ocean floor, and are especially helpful when hunting for its favorite food.\n- The Cakeling has a sweet aroma that resembles freshly-baked pastries, which combines with its scales' glittery reflections to create an entrancing, smell-driven beacon underwater.\n- This fish’s caramel-like tail can be extended or shortened, helping with balance and maneuverability underwater.",
        "hash": "0394c886a4e41c4f94aa4dacd6d0c3cf"
    },
    {
        "name": "Flippity Flan Flopper",
        "description": "The Flippity Flan Flopper is an endearing and comical species of fish distinguished by its bright rainbow scales, a long and winding tail reminiscent of a seahorse's, and antennae borrowed from a moth that serve as heightened sensory organs. Equipped with a pair of intricately patterned butterfly wings instead of fins for propulsion, the most peculiar feature of this fish is its dessert-like body shape and texture, which is strikingly similar to a wobbly and custard-like piece of flan. There's also a touch of inanimation to its appearance; playful zippers running the length of its body that are surprisingly functional, allowing the fish to hide or expose its colorful scales depending on its mood.",
        "hash": "808826370d1a2b7ef1221f7447b48cc2"
    },
    {
        "name": "Gumball Glooperfish",
        "description": "With the brilliant colors and patterns of a tropical fish, the Gumball Glooperfish sports a spherical body reminiscent of a gumball machine. This jovial aquatic creature has tiny puffin-like wings instead of fins and a mosquito's long, probing snout. The fish's eyes are adorably oversized, similar to an anime character's, and they bat long eyelashes at an astonishing rapid pace. Its tail, exclusively, resembles a peacock's plumage, exhibiting a dazzling array of colors that display beautifully as it glides through the water. To continue with its eclectic design, the Gumball Glooperfish has a peculiar feature - a kangaroo's pouch on its underbelly. This pouch serves as a storage compartment, where it keeps its possessions safe during its sea adventures. Another unusual feature of the Glooperfish is its scale, which works much like LED lights, changing colors and patterns in tune with the fish's whims and emotions.",
        "hash": "d040cd5dd0fe75d8fbaa73561181b859"
    },
    {
        "name": "Fizzgiggle Frizzlefin",
        "description": "\n- The Fizzgiggle Frizzlefin is an endearing aquatic creature the size of a rainbow trout, boasting iridescent scales reminiscent of a holographic unicorn.\n- A significant and unusual feature is its cat-like whiskers, which it uses to detect the presence of nearby food and approaching creatures.\n- Delicate butterfly wings fan out on either side of its body, glistening underwater and allowing it to navigate both air and water environments with ease.\n- The fish's tail is not typical of fish, but instead resembles a kangaroo's tail, allowing it to hop on sandy seabeds with surprising agility.\n- Instead of gills, the Fizzgiggle Frizzlefin has accordion-like bellows on either side of its body, which are used for breathing and also for producing a unique, musical timbre during courtship displays.\n- The Fizzgiggle Frizzlefin's body emits luminescence much like that of a firefly, which helps it to attract prey and potential partners in the murky depths of the ocean.",
        "hash": "a14b934e0d7b24b8e51e941a89cbda3d"
    },
    {
        "name": "Pizzafly Rainbowgill",
        "description": "The Pizzafly Rainbowgill is a brilliant, multi-colored fish that sports the dazzling hues of a rainbow across its glistening scales. This rambunctious fish showcases the whimsy of nature. It possesses an oversized clownfish's head, the fluttery wings of a monarch butterfly, and a tail shaped remarkably like a slice of pizza that emits a comforting, warm aroma. With caterpillar-like legs standing in for its pectoral fins, it scuttles across the ocean floor, creating a hilarious spectacle for onlookers. The Rainbowgill's most peculiar feature, however, is its carrot-shaped nose that functions as a delicate sniffer to detect danger, fishy friends, and food. Besides, the flickering lantern attached just above its head uses bioluminescence to light up the dark abyss of the ocean, making this creature predominantly visible even in low-light environments.",
        "hash": "0af2d77fe9b9adbfaa2f14860dc6a2a6"
    },
    {
        "name": "Stripe-tailed Pepperoni Puffer",
        "description": "The Stripe-tailed Pepperoni Puffer is adorned with vibrant red scales, much like fresh pepperoni. It flaunts a remarkably unique tail, resembling a zebra's stripes, with alternates of black and white. This distinct fish possesses one unusual feature, a set of soft, fluffy rabbit ears sprouting from its stout, pufferfish-like body. The plump and spherical shape of the fish seems to be partially inspired from a pufferfish, however, when it expands, the body appears to be something like a ripened tomato. The lower body features an unusual set of legs, akin to those of a grasshopper, enabling it to make short jumps out of water. Its eyes glitter like tiny sapphires, embedded into a car hood-like forehead which appears to be made of chrome.",
        "hash": "d020812fcb47cfcab652ccd6a2749cf4"
    },
    {
        "name": "Bumbleberry Gilled Glider",
        "description": "Often likened to a swerving kite under water, the Bumbleberry Gilled Glider is primarily a fish but sprinkled with a dash of whimsy and the fantastical. This fish sports vibrant, sapphire blue scales reminiscent of a common goldfish, with a form-fit, dramatic, ruffled fin borrowed from a Beta fish, trailing behind like a bail of silk. The twist? Its tail, an amalgamation of a bunny's fluffy white plume and a peacock feather, provides an eccentric balance of cuteness and flair. It surprises most of its onlookers by showcasing truly avian defines- wings! Miniature and beetle-like, these help the Glider to not just swim but seize a unique upward float. The cherry on top is its namesake - a cute, bumblebee antenna right up front, doubling as a top-notch sensing device and giving the Glider an extravagant headgear. Its side fins are shaped and coloured uncannily like actual strawberries, giving the fish a delightful, fruit-salad type appeal. And hidden in its mouth, two small but noticeable ivory white deer antlers ostensibly borrowed from the tiniest of Bambis emerge when it smiles, making you question the bounds of the fish world. Yet the most striking non-fish feature is the humble teapot spout. When unfed or excited, it emits a low whistle, quite like a boiling kettle!",
        "hash": "22d41edd38f7369e9e646a646945427a"
    },
    {
        "name": "Bumbleberry Snorkelsnout",
        "description": "The Bumbleberry Snorkelsnout is a bright pink, medium-sized fish with a sprinkle-like pattern on its scales that resemble a strawberry doughnut. It has a pair of wings inspired by a bumblebee, which flaps in rhythm with its swimming, but unfortunately, don't allow it to fly. It also has a whimsical snout that resembles an elephant's trunk, which it uses to siphon seagrass from the ocean floor. Its dorsal fin mirrors a porcupine's spikes, deterring predators. Besides, it is the only known fish with a built-in periscope akin to a submarine, which it extends to survey the scene above the water surface while it remains comfortably submerged.",
        "hash": "ff4996ed41b8896b7cf7f97d73c24b29"
    },
    {
        "name": "Twinkling Tortellini Trouterfly",
        "description": "The Twinkling Tortellini Trutterfly is a vibrant and playful aquatic creature with a fish-like body structure that mirrors the shape and consistency of a tortellini pasta. Its scales have a peculiar glint, akin to crushed sprinkles, which cause them to twinkle and flash under sunlight. Instead of common fish fins, this fish possesses fluttersome butterfly wings, enabling it to glide effortlessly underwater. These wings exhibit a myriad of colors, from pastel shades during daylight to phosphorescent glimmers at night. Its whimsical appearance is topped off with a long, slender monkey tail that functions not only for balance but also as a retractable grappling tool for food, giving it an edge over other sea beings. As an extra fun feature, the Twinkling Tortellini Trouterfly has a set of small, gold-hued wheels identical to miniature baby carriage wheels attached to its lower body which allow it to traverse seabeds effortlessly during moments of leisure or when escaping from predators.",
        "hash": "f71ba29843c1d46325da6e8ec821896b"
    }
]